var list = {
    "北京市": {
        "瑞蓝": [
            "北京北海医院",
            "中国人民解放军总医院",
            "北京大学第三医院（整形美容科）",
            "北京大学第一医院（皮肤科)",
            "北京口腔医院",        
            "北京南苑医院",
            "北京大学人民医院",
            "北京友谊医院",
            "清华长庚医院",
            "北京武警总医院",
            "北京军区总医院",
            "北京美联臣整形美容医院",
            "中国人民解放军海军总医院医学美容中心",
            "北京伊美尔幸福整形医院",
            "北京伊美尔医疗美容医院",
            "北京美联臣整形美容医院",
            "中国人民解放军海军总医院医学美容中心",
            "北京伊美尔幸福整形医院",
            "北京伊美尔医疗美容医院",
            "北京黄寺美容外科医院",
            "北京叶子整形美容医院",
            "中国人民解放军空军总医院激光美容中心",
            "北京医科整形美容门诊部",
            "北京伊美尔爱康整形美容医院",
            "北京伊美尔健翔医院",
            "北京伊美尔长岛医疗美容门诊部",
            "北京伊美尔紫竹医疗美容门诊部",
            "北京美莱医疗美容医院",
            "北京丽都医疗美容医院",
            "北京华韩医疗美容医院",
            "北京雅韵医疗美容门诊部",
            "北京东方瑞丽医学美容门诊部",
            "北京美束激光医疗诊所",
            "北京尚美医疗美容诊所",
            "北京欧华医疗美容诊所",
            "北京东田医疗美容诊所",
            "北京米扬丽格医疗美容门诊部",
            "北京卓彦丽格医疗美容诊所",
            "北京爱悦丽格医疗美容诊所",
            "北京泽尔丽格健康科技发展有限公司",
            "北京小忠丽格医疗美容门诊部",
            "北京京韩医疗美容诊所",
            "北京嘉悦丽眼科门诊部",
            "北京慈诚诊所",
            "北京三仁医疗美容门诊部",
            "煤炭总医院",
            "北京邦定美容整形外科门诊部",
            "北京联合丽格医疗美容诊所",
            "北京奥德丽格医疗美容门诊部",
            "北京东方美莱医疗美容门诊部",
            "北京丽都医疗美容医院",
            "北京慈诚诊所",
            "北京成铭诊所",
            "北京五洲妇儿医院",
            "北京平安整形外科门诊部",
            "北京爱美门诊部",
            "北京艾玛医疗美容诊所",
            "北京禾美嘉医疗美容诊所有限公司",
            "北京常好丽格医疗美容门诊部有限公司"
        ],
        "乔雅登": [
            "北京丽都医疗美容医院",
            "北京叶子整形美容医院",
            "北京美联臣医疗美容医院",
            "北京伊美尔幸福美容医院",
            "北京华韩医疗美容医院",
            "北京德美联凌云医疗美容诊所",
            "北京莫琳娜医疗美容诊所",
            "北京佳妍医疗美容诊所",
            "北京庆熙医疗美容门诊部",
            "柠悦轻医美",
            "北京欧扬医疗美容诊所",
            "北京加减美医疗美容诊所",
            "紫洁俪方医疗美容诊所",
            "北京美诗沁医疗美容诊所",
            "北京芙艾医疗美容门诊部",
            "北京欧亚美容医疗美容诊所",
            "北京爱美医疗美容诊所",
            "邦定美容整形",
            "北京卓新华星医疗美容医院",
            "北京俪美汇医疗门诊部",
            "北京海医悦美医疗美容医院",
            "北京凯润婷医疗美容医院",
            "北京春语医疗美容门诊部",
            "北京君和医疗美容门诊部",
            "北京嘉和百旺医疗门诊部",
            "北京丽景洲际医疗美容诊所",
            "北京宝岛妇产医院",
            "北京水研社医疗美学中心",
            "北京伊芙丽格医疗美容诊所",
            "北京长虹医院",
            "北京斯凯丽雅医疗美容诊所",
            "新氧云诊所北京水研店",
            "新氧云诊所北京丽扬店",
            "北京韩啸医疗美容门诊部",
            "北京悦美好医医疗美容医院",
            "伟力•嘉美信医疗美容门诊部",
            "伍坤医疗美容诊所",
            "北京瑞妍茗医门诊部",
            "奥德丽格医疗美容机构",
            "北京壹加壹医疗美容门诊",
            "北京三仁医疗美容门诊部",
            "田永成医疗美容医院",
            "北京润美玉之光医疗美容门诊部",
            "北京爱悦丽格医疗美容诊所",
            "北京泽尔丽格医疗美容诊所",
            "北京新星靓医疗美容门诊部",
            "北京焕誉医疗美容门诊部",
            "北京圣嘉新医疗美容医院",
            "北京吉光宇美颐天医疗美容诊所",
            "北京惠平霖医疗美容诊所",
            "北京艺星医疗美容医院",
            "北京微丽医疗美容诊所",
            "北京澳玛星光医疗美容诊所",
            "北京薇琳医疗美容医院",
            "北京医科整形美容门诊部",
            "北京京韩医疗美容诊所",
            "小忠丽格医疗美容医院",
            "北京欧华医疗美容诊所",
            "北京美莱医疗美容医院",
            "北京米扬丽格医疗美容门诊部",
            "北京伊美尔紫竹医疗美容门诊部",
            "北京伊美尔长岛医学美容医院",
            "北京伊美尔健翔整形美容医院",
            "北京伊美尔爱康医疗美容医院",
            "北京卓彦丽格医疗美容诊所"
        ],
        "法思丽": [
            "北京金凤凰医院",
            "北京圣嘉新医疗美容医院",
            "北京艺星医疗美容医院",
            "北京春语医疗美容门诊部",
            "北京君和医疗美容门诊部",
            "北京伊美尔幸福整形医院",
            "北京伊美尔医疗美容医院",
            "北京伊美尔健翔医院",
            "北京伊美尔紫竹医疗美容门诊部",
            "北京凯润婷医疗美容医院有限公司"
        ]
    },
    
    "天津市": {
        "瑞蓝": [
            "天津市中心医院",
            "天津市眼科医院",
            "天津美莱医学美容医院",
            "天津河西维美医疗美容医院",
            "天津伊美尔医疗整形美容专科医院",
            "天津河东美莱医学美容医院有限公司",
            "天津御芝堂医学美容门诊部"
        ],
        "乔雅登": [
            "天津伊美尔医疗整形美容专科医院",
            "天津滨海新区兰恩医疗美容诊所",
            "天津南开联合丽格医疗美容医院",
            "天津塘沽吴翠芳汉诚医疗美容诊所",
            "天津南开欧非整形美容医院",
            "天津河西坤如玛丽妇产医院",
            "天津美莱医学美容医院",
            "天津河西维美医疗美容医院"
        ],
        "法思丽":[
            "天津和平御芝堂医学美容门诊部",
            "天津伊美尔医疗整形美容专科医院有限公司",
        ]
    },
    
    "上海市": {
        "瑞蓝": [
            "上海伯思立医疗美容门诊部",
            "上海光博士医疗美容门诊部",
            "上海交通大学附属第九人民医院",
            "复旦大学附属华山医院",
            "上海美莱医疗美容",
            "上海仁爱医院",
            "上海时光整形外科医院",
            "上海玫瑰医疗美容医院",
            "上海伊美尔港华医疗美容医院",
            "上海艺星整形医院",
            "上海华美医疗美容医院",
            "上海第二军医大学附属长海医院",
            "上海天大医疗美容医院",
            "上海柏荟医疗美容门诊部",
            "上海瑞妮丝医疗美容门诊部",
            "上海纽顿医疗美容门诊部",
            "上海美妍康医疗美容门诊部",
            "Phiskin芙艾医疗 上海淮海门诊",
            "Phiskin芙艾医疗 上海静安门诊",
            "上海美莱医疗美容门诊部",
            "上海伊莱美医疗美容医院",
            "上海真爱医院",
            "上海宏康医院",
            "上海星和医疗美容门诊部",
            "上海凯渥医疗美容门诊部",
            "上海荣恩医疗美容门诊部"
        ],
        "乔亚登": [
            "上海玫瑰医疗美容医院",
            "上海时光整形外科医院",
            "上海凯渥医疗美容门诊部",
            "上海华澳整形美容医疗中心",
            "上海华美医疗美容医院",
            "上海欧华医疗美容医院",
            "上海芙艾门诊部",
            "喜美医疗美容医院",
            "上海优仕美地医疗门诊部",
            "上海凯瑞医疗美容门诊部",
            "上海力信医疗美容诊所",
            "上海余天成医疗美容门诊部",
            "上海仁爱医院",
            "上海艺星美容医院",
            "上海诺诗雅医疗美容医院",
            "上海名媛医疗美容门诊部",
            "上海薇琳医疗美容医院",
            "智美颜和国际医美",
            "上海和睦家医院整形外科",
            "上海芷妍医疗美容门诊部",
            "上海美莱医疗美容门诊部",
            "星和医疗美容门诊部",
            "上海美立方医疗美容医院",
            "光博士医疗美容门诊部",
            "上海馨美医疗美容门诊部",
            "上海荣恩医疗美容门诊部",
            "上海颜术医疗美容门诊部",
            "上海市铂曼医疗美容医院",
            "上海伯思立医疗美容门诊部",
            "上海美联臣医疗美容医院",
            "上海伊莱美医疗美容医院"
        ],
        "法思丽": [
            "上海薇琳医疗美容医院",
            "上海美妍康医疗美容门诊部有限公司",
            "上海鲁南门诊部",
            "上海悦薇堂医疗美容门诊部",
            "上海澳雅医疗美容医院",
            "上海复美医疗美容门诊部",
            "上海华美医疗美容医院有限公司",
            "上海美联臣医疗美容医院有限公司",
            "上海美立方医疗美容医院",
            "上海圣汇医疗美容门诊部",
            "上海宏康医院",
            "上海爱丽姿医疗美容医院",
            "上海纽赛医疗美容门诊部",
            "上海美妍康医疗美容门诊部",
            "上海华侨医疗门诊部",
            "上海玫瑰医疗美容医院"
        ]
    },

    "安徽省": {
        "瑞蓝": [
            "合肥华美整形美容医院",
            "安徽韩美整形外科医院",
            "安徽维多利亚整形外科医院",
            "壹加壹（合肥）整形美容医院"
        ],
        "乔雅登": [
            "合肥安妮薇尔美容门诊",
            "合肥恒美医疗美容门诊",
            "崔劲松微创医疗美容门诊",
            "宿州阳光医疗美容门诊部",
            "蚌埠韩丽医疗美容门诊部",
            "淮北东方美莱坞医疗美容医院",
            "蚌埠东方美莱坞医疗美容门诊",
            "芜湖伊莱美整形外科医院",
            "合肥艺星整形美容医院",
            "合肥华美整形美容医院",
            "安徽维多利亚整形外科医院",
            "安徽韩美整形外科医院",
            "合肥壹加壹美容医院"
        ],
        "法思丽": [
            "安徽韩美整形外科医院",
            "合肥市艺星医疗美容医院",
            "合肥台美医疗美容门诊部",
            "安徽维多利亚整形外科医院",
            "芜湖伊莱美整形外科医院",
            "合肥华美整形美容医院",
            "合肥丽人妇科医院",
            "芜湖壹加壹医疗美容门诊部",
            "合肥壹加壹整形美容医院"
        ]
    },

    "四川省": {
        "瑞蓝": [
            "青岛妇婴医院",
            "四川华美紫馨医学美容医院",
            "美莱医学美容医院",
            "悦好医学美容医院",
            "美瑞皮肤医疗美容",
            "成都美容整形医院",
            "四川大学华西口腔医院",
            "四川省中西医结合医院",
            "成都军区机关医院",
            "成都中医药大学附属医院",
            "四川省人民医院皮研所",
            "四川大学华西医院",
            "四川西婵整形美容医院",
            "成都市第三人民医院",
            "四川西婵泛亚整形美容医院"
        ],
        "乔雅登": [
            "四川华美紫馨医学美容医院",
            "四川西婵整形美容医院",
            "四川悦好医学美容医院",
            "四川汉密尔顿美容医院",
            "四川美莱医疗美容医院",
            "攀枝花春语医疗美容诊所",
            "成都武侯春语医疗美容门诊部",
            "成都青羊春芽医疗门诊部",
            "成都美容整形医院",
            "成都美瑞皮肤医疗美容医院",
            "成都军大医学研究所附属医院",
            "乐山经纬医学美容",
            "成都艺星医疗美容整形医院",
            "成都大华韩艺整形美容医院",
            "四川娇点医学美容医院",
            "米兰柏羽医学美容医院",
            "成都天府新区可纳儿门诊部",
            "成都铜雀台整形美容医院",
            "成都大华医学美容医院"
        ],
        "法思丽": [
            "天使之翼美天整形美容医院",
            "成都大华韩艺整形美容医院有限公司",
            "成都铜雀台整形美容医院有限公司"
        ] 
    },

    "重庆市": {
        "瑞蓝": [
            "重庆新铜雀台整形美容医院",
            "重庆星宸美容医院有限公司",
            "重庆华美整形美容医院",
            "重庆天妃整形美容医院",
            "万州华美紫馨整形美容医院",
            "重庆当代整形美容医院",
            "重庆美仑美奂医疗整形美容门诊部",
            "重庆华美整形美容医院",
            "重庆联合丽格美容医院有限公司",
            "重庆市急救医疗中心",
            "重庆艺星医疗美容医院",
            "重庆伊雪医疗美容门诊部",
            "重庆天妃整形美容医院",
            "重庆市万州区华美紫馨整形美容医院",
            "重庆星范丽格医疗美容有限公司",
            "重庆联合丽格美容医院有限公司",
            "重庆万州华美整形美容医院"
        ],
        "乔雅登": [
            "重庆铜雀台整形美容医院",
            "重庆华美整形美容医院",
            "重庆当代整形美容医院",
            "重庆春语医疗美容诊所",
            "重庆万州华美紫馨整形美容医院",
            "重庆爱思特真伊整形美容医院",
            "重庆艺星医疗美容医院",
            "重庆天妃整形美容医院"
        ],
        "法思丽": [
            "重庆真伊医疗美容医院有限公司",
            "重庆当代整形美容医院",
            "重庆艺星医疗美容医院",
            "重庆美仑美奂整形美容医院"
        ]
    },

    "江苏省": {
        "瑞蓝": [
            "南京华美美容医院",
            "南京维多利亚美容门诊部有限公司",
            "南京华美美容医院",
            "东南大学附属中大医院",
            "南京市鼓楼医院",
            "南京医科大学附属友谊整形外科医院",
            "南京市妇幼保健院医疗美容科",
            "南京奇致整形美容医院",
            "南京展超丽格美容诊所",
            "南京连天美医院",
            "苏州爱思特医疗美容诊所",
            "常州瑞金美贝尔医疗美容医院",
            "南通俪人医疗美容医院",
            "无锡春天美容医院",
            "常州曙光医疗美容医院",
            "苏州吴中维多利亚美容医院",
            "苏州美贝尔医疗美容门诊部",
            "苏州美莱美容医院",
            "无锡尚美整形美容医院",
            "无锡瑞丽整形美容医院",
            "美莱（苏州）美容医院",
            "苏州圣爱医院",
            "无锡瑞丽整形美容医院"
        ],
        "乔雅登": [
            "南京医科大学附属友谊整形外科医院",
            "苏州美莱美容医院",
            "南京华韩奇致美容医院",
            "南京华美美容医院",
            "南京康美整形美容医院",
            "江苏施尔美整形美容医院",
            "南京维多利亚整形美容医院",
            "南京韩辰整形医院",
            "南京连天美医院",
            "南京展超丽格美容医院",
            "苏州爱思特医疗美容医院",
            "泰州丽都医疗美容医院",
            "苏州金阊医院",
            "昆山百达丽医疗美容",
            "徐州仁慈医院",
            "泉山洪扬医疗美容诊所",
            "南京江宁亚韩美容医院",
            "新浦东苑社区大明整形美容诊所",
            "南京春语建邺医疗美容诊所",
            "苏州澳美医疗美容诊所",
            "徐州华美美容医院",
            "无锡同济医疗美容医院",
            "无锡米兰医疗美容医院",
            "常熟瑞丽美贝尔医院",
            "常州曙光医疗美容医院",
            "无锡施尔美医疗美容医院",
            "无锡美联臣医疗美容医院",
            "苏州圣爱医院",
            "苏州薇琳美容医院",
            "无锡坤如玛丽医院",
            "常州施尔美医疗美容医院",
            "常州美贝尔医疗美容医院",
            "无锡爱思特整形美容医院",
            "南通俪人医疗美容医院",
            "南通康美整形美容医院",
            "徐州心源美容医院",
            "扬州施尔美医疗美容医院",
            "苏州美贝尔整形医院",
            "苏州维多利亚美容医院",
            "无锡尚美整形美容医院",
            "南通维多利亚医疗美容医院",
            "丽都整形美容医院"
        ],
        "法思丽": [
            "南京医科大学友谊整形外科医院",
            "丽都整形美容医院",
            "苏州圣爱医院",
            "苏州金阊医院",
            "无锡曼陀罗美容医院",
            "无锡施尔美医疗美容医院",
            "南京华韩奇致美容医院",
            "苏州爱思特美容医院",
            "无锡爱思特整形美容医院"
        ]
    },
    
    "浙江省": {
        "瑞蓝": [
            "杭州格莱美医疗美容医院",
            "杭州同欣整形美容医院",
            "杭州颜术时尚医疗美容诊所",
            "温州加美美容医院",
            "温州医科大学附属第一医院",
            "杭州美莱医疗美容医院",
            "浙江省人民医院",
            "杭州维多利亚医疗美容医院",
            "杭州艺星医疗美容医院",
            "杭州整形医院",
            "杭州市第一人民医院",
            "杭州时光医疗美容医院",
            "杭州美莱医疗美容医院",
            "杭州华山连天美医疗美容医院",
            "宁波海曙专科医疗美容专科门诊",
            "台州维多利亚整形美容中心",
            "义乌欧莱美医疗美容医院",
            "诸暨欧莱美医疗美容医院",
            "温州和平整形医院",
            "宁波珈禾整形专科医院有限公司",
            "宁波江东薇琳美容医院有限公司",
            "宁波江东壹加壹美容医院有限公司",
            "宁波美莱整形医院",
            "慈溪圣爱医院",
            "台州市博雅美惠医疗美容整形门诊部",
            "台州骨伤医院",
            "嘉兴市曙光中西医结合医院",
            "湖州曙光医疗美容门诊部"
        ],
        "乔雅登": [
            "杭州华山连天美医疗美容医院",
            "杭州维多利亚医疗美容医院",
            "宁波珈禾整形医院",
            "杭州时光医疗美容医院",
            "温州和平整形医院",
            "杭州美莱医疗美容医院",
            "宁波颜术新蕾医疗美容诊所",
            "杭州秀华医疗美容诊所",
            "宁波静港医疗美容诊所",
            "杭州新静医疗美容诊所",
            "杭州静港医疗美容诊所",
            "宁波江东春语医疗美容门诊部",
            "杭州春语医疗美容诊所",
            "温州上雅医疗美容门诊部",
            "鹿城恒美医疗美容门诊部",
            "温州星范医疗美容门诊部",
            "杭州芯美昕医疗美容医院",
            "宁波雅韩医疗美容",
            "宁波海曙芙艾医疗美容",
            "宁波缔艺医疗美容医院",
            "杭州静娇医疗美容诊所",
            "杭州卓俪荟医疗美容诊所",
            "嘉兴禾美医疗美容医院",
            "杭州悦可医疗美容诊所",
            "杭州清吟医疗美容诊所",
            "台州市博爱医院",
            "杭州萧山黛雅医疗美容整形医院",
            "杭州丽星国际整形医院",
            "杭州依萱绮医学美容",
            "湖州曙光医疗美容门诊部",
            "宁波美苑医学美容",
            "温州艺星医学美容医院",
            "绍兴维美美容医院",
            "慈溪悦尔医学美容医院",
            "杭州艺星医疗美容医院",
            "衢州华美美容医院",
            "诸暨欧莱美医疗美容医院",
            "宁波美之术医疗美容医院",
            "宁波海曙美莱医疗美容",
            "杭州格莱美医疗美容医院",
            "宁波江东壹加壹美容医院",
            "嘉兴华山整形美容",
            "杭州珈禾医疗美容医院",
            "杭州颜术悦容医疗美容诊所",
            "宁波美莱整形美容",
            "杭州颜术时尚医美中心",
            "杭州整形医院",
            "杭州瑞丽医疗美容医院",
            "台州维多利亚整形美容中心",
            "嘉兴曙光整形"
        ],
        "法思丽": [
            "嘉兴市禾美医疗美容医院有限公司",
            "衢州市苏杭医疗美容诊所",
            "杭州华山连天美医疗美容医院有限公司",
            "杭州艺星医疗美容医院",
            "杭州芯美昕医疗美容门诊部",
            "杭州港诚医疗美容门诊部有限公司",
            "台州维多利亚整形美容门诊部有限公司",
            "台州维多利亚整形美容门诊部有限公司",
            "温州玉熙医疗美容门诊部有限公司",
            "金华瑞丽门诊部",
            "绍兴维美美容医院有限公司"
        ]
    },
    
    "湖北省": {
        "瑞蓝": [
            "湖北省人民医院",
            "武汉市中心医院",
            "武汉美来医疗美容医院",
            "武汉亚太整形美容医院",
            "武汉协和医院整形外科",
            "武汉艺星医疗美容医院",
            "武汉中翰整形美容医院",
            "武汉五洲美莱整形美容医院",
            "宜昌前卫中韩整形美容医院",
            "宜昌亚太国际整形美容医院",
            "武汉美立方医疗美容门诊部",
            "武汉美基元医疗美容医院",
            "武汉韩辰医疗美容门诊部",
            "武汉美基元医疗美容门诊部"
        ],
        "乔雅登": [
            "武汉五洲整形美容医院",
            "武汉禾丽康美医疗美容医院",
            "武汉恩吉娜医疗美容门诊部",
            "宜昌西陵区前卫整形美容门诊部",
            "武汉春语医疗美容武昌门诊部",
            "武汉美之术医疗美容医院",
            "武汉贝蓓国际医学抗衰机构",
            "武汉富康激光医疗美容门诊部",
            "武汉春语医疗美容门诊部",
            "武汉美基元医疗美容医院",
            "武汉美聚医疗美容",
            "十堰安琪儿整形美容医院",
            "襄阳维多利亚医疗美容门诊部",
            "襄阳华美整形美容医院",
            "迪亚罗兰医疗整形美容医院",
            "武汉华美整形外科医院",
            "武汉艺星医疗美容医院",
            "武汉爱思特整形医院",
            "武汉美莱医疗美容医院",
            "武汉中翰整形外科医院",
            "武汉韩辰医疗美容",
            "宜昌亚太整形美容医院"
        ],
        "法思丽": [
            "武汉韩辰医疗美容医院",
            "武汉中翰整形外科医院",
            "武汉爱思特医疗美容医院"
        ]
    },
    
    "湖南省": {
        "瑞蓝": [
            "中南大学湘雅医院",
            "中南大学湘雅二医院",
            "长沙美莱医疗美容医院",
            "长沙爱思特医疗美容医院",
            "长沙亚韩医学整形美容医院",
            "长沙雅美医疗美容医院",
            "长沙艺星医疗美容医院",
            "长沙鹏爱医疗美容有限公司",
            "长沙伊百丽医疗美容医院",
            "长沙瑞澜医疗美容医院",
            "长沙华美诺德医疗美容有限公司"
        ],
        "乔雅登": [
            "长沙美莱医疗美容医院",
            "长沙爱思特美容整形医院",
            "长沙亚韩国际医学整形美容医院",
            "长沙市春语医疗美容门诊部",
            "长沙好年轻医疗美容医院",
            "长沙艺星医学美容医院",
            "长沙华韩华美医疗美容医院",
            "长沙雅美医疗美容医院"
        ],
        "法思丽": [
            "湖南雅美医疗美容医院",
            "长沙爱思特医疗美容",
            "衡阳爱思特医疗美容医院",
            "常德爱思特医疗美容",
            "岳阳爱思特医疗美容",
            "株洲爱思特医疗美容",
            "娄底爱思特医疗美容",
            "郴州爱思特医疗美容",
            "湘潭爱思特医疗美容",
            "益阳爱思特医疗美容",
            "长沙市美之峰医疗美容"
        ]
    },
    
    "福建省": {
        "瑞蓝": [
            "福建医科大学附属第一医院整形外科",
            "福建医科大学附属协和医院整形外科",
            "厦门长庚医院",
            "厦门思明海峡门诊部",
            "厦门美莱医疗美容医院",
            "厦门修志夫整形外科门诊部",
            "厦门思明欧菲医疗美容门诊部",
            "泉州丰泽海峡医疗美容门诊部",
            "泉州丰泽西华医疗美容门诊部",
            "泉州丰泽欧菲医疗美容门诊部",
            "福州美莱华美美容医院",
            "福州台江医院整形美容科",
            "福州海峡美容医院",
            "美莱（泉州）华美整形美容医院",
            "名韩国际整形美容医院",
            "泉州鲤城美莱华美整形美容医院",
            "厦门思明薇格整形外科门诊部"
        ],
        "乔雅登": [
            "福州海峡美容医院",
            "福清天宝美容医院",
            "厦门思明华美医疗美容门诊部",
            "厦门海沧庄锦波美容外科诊所",
            "厦门欧菲医疗美容门诊部",
            "福州比华利美容医院",
            "厦门美莱医疗美容",
            "厦门海峡医疗美容",
            "福州美莱华美美容医院",
            "泉州美莱华美医疗美容医院",
            "泉州丰泽海峡医疗美容门诊部",
            "厦门思明修志夫整形美容",
            "福州名韩医疗美容",
            "福州台江医院整形美容科"
        ],
        "法思丽": [
            "福州比华利美容医院",
            "厦门思明海峡医疗美容门诊部",
            "泉州丰泽欧菲医疗美容门诊部"
        ]
    },

    "广东省": {
        "瑞蓝": [
            "南方医科大学南方医院整形美容外科",
            "暨南大学附属第一医院整形美容激光科",
            "中山大学孙逸仙纪念医院整形外科",
            "广东省皮肤病医院激光整形美容中心",
            "佛山市第一人民医院整形美容科",
            "中山医科大学《家庭医生》医学整形美容医院",
            "广州现代医院",
            "广州广美整形美容医疗门诊部",
            "广州市越秀区粤秀整形外科门诊部",
            "广州妍雅医疗门诊部",
            "广州壹加壹整形美容医院",
            "广州美莱医疗美容医院",
            "广州紫馨医疗美容医院",
            "解放军第四五八医院",
            "广州美恩整形美容医院",
            "广东省第二人民医院整形美容激光中心",
            "广州军区广州总医院",
            "广州曙光医学美容医院",
            "广州华美医学美容医院",
            "珠海科美医疗美容医院",
            "珠海莱茵整形美容医院",
            "珠海九龙医院",
            "玛丽亚（东莞）医学美容",
            "东莞美立方整形美容医院",
            "禅城区苏李秀英医院",
            "顺德壹加壹玛丽亚美容医院",
            "深圳吉美瑞丽斯医疗美容门诊部",
            "深圳富华医疗美容医院",
            "深圳美莱医疗美容医院",
            "北京大学深圳医院",
            "深圳广和门诊部",
            "深圳希思医疗美容医院",
            "深圳远东妇儿科医院",
            "深圳阳光整形美容医院",
            "深圳博爱医院",
            "深圳春天医院",
            "深圳非凡医疗美容医院",
            "深圳鹏爱医疗美容医院",
            "深圳鹏程医疗美容医院"
        ],
        "乔雅登": [
            "广州华美医疗美容医院",
            "深圳阳光整形美容医院",
            "广州曙光医学美容医院",
            "深圳美莱医疗美容医院",
            "深圳非凡医疗美容医院",
            "中家医家庭医生整形美容医院",
            "广州美莱医疗美容医院",
            "广州粤秀整形外科医院",
            "深圳贝漾美天医疗美容门诊部",
            "江门华美整形美容医院",
            "珠海新颜医疗美容",
            "春语医疗美容门诊部",
            "肇庆华美医学整形美容医院",
            "佛山市媄健专科门诊部",
            "佛山市颜植医疗美容门诊部",
            "佛山市禅城区中心医院",
            "深圳市千羽医疗美容医院",
            "深圳鹏爱医疗美容医院",
            "深圳新氧医疗美容门诊部",
            "广州唯伊整形医院",
            "珠海九龙医院",
            "珠海莱茵门诊部",
            "深圳市南山区王展皮肤科诊所",
            "蓝海之略个人形象定制中心",
            "广二医疗美容门诊部",
            "广州弘基医疗门诊部",
            "军美医疗美容门诊部",
            "深圳鹏程医院",
            "深圳米兰柏羽医疗美容门诊部",
            "顺德壹加壹玛丽亚美容医院",
            "深圳福华医疗美容医院",
            "湛江华美整形美容医院",
            "汕头华美整形美容医院",
            "中山美南华美容医院",
            "深圳联合丽格医疗美容门诊部",
            "深圳富华医疗美容医院",
            "深圳欧亚美医疗美容门诊部",
            "深圳臻瑞芝美医疗美容门诊部",
            "深圳江南春天医疗美容医院",
            "深圳希思医疗美容医院",
            "深圳广和整形",
            "深圳远东妇儿科医院",
            "深圳博爱医院",
            "广州美恩整形美容医院",
            "广州壹加壹美容医院",
            "广州白云区韩妃医学美容门诊部",
            "广州天河珈禾医疗美容门诊部",
            "中山爱思特美容医院",
            "汕头市曙光整形美容",
            "广州紫馨美容医院",
            "珠海美涵医疗美容",
            "佛山市苏李秀英医院整形美容科",
            "广州海峡医学整形美容",
            "东莞莞城美立方美容医院"
        ],
        "法思丽": [
            "广州艾美鼻整形",
            "广州天河爱来医疗美容（阿玛施）门诊部",
            "广州广美整形医疗美容门诊部",
            "深圳非凡医疗美容医院",
            "中山爱思特美容医院",
            "广州壹加壹整形美容医院",
            "中山爱思特美容医院",
            "顺德壹加壹玛丽亚美容医院",
            "肇庆民和医院",
            "东莞南城瑞芙臣医疗美容门诊部",
            "东莞唯美医疗美容门诊部",
            "东莞虎门童话医疗美容门诊部",
            "东莞缔美美容医院"
        ]
    },
    
    "甘肃省": {
        "瑞蓝": [
            "兰州时光整形美容医院",
            "兰州三爱整形美容医院",
            "兰州东方医疗整形美容诊所",
            "兰州美丽达医学整形门诊部",
            "兰州美月医疗美容医院",
            "肃州区艺星医学整形美容门诊部"
        ],
        "乔雅登": [
            "兰州时光整形美容医院"
        ]
    },
    
    "广西壮族自治区": {
        "瑞蓝": [
            "广西壮族自治区人民医院",
            "南宁美丽在造医疗美容诊所",
            "南宁思瑞医疗美容诊所",
            "南宁华美医疗美容有限公司",
            "广西医科大学第一附属医院西院美容整形外科",
            "广西南宁东方医疗美容专科医院有限公司"
        ],
        "乔雅登": [
            "南宁华美整形美容医院",
            "桂林华美医疗美容门诊部",
            "桂林叶氏嘉美医疗美容整形",
            "南宁梦想医疗美容整形医院",
            "广西南宁东方医疗美容医院"
        ],
        "法思丽": [
            "广西爱思特医疗美容医院"
        ]
    },
    
    "海南省": {
        "瑞蓝": [
            "海口鹏爱医疗美容门诊部",
            "海南东湖医学美容医院",
            "海南瑞韩医学美容医院",
            "海南美媛医学美容门诊"
        ],
        "乔雅登": [
            "三亚福音整形医院",
            "海南瑞韩医学美容医院"
        ],
        "法思丽": [
            "红妆尚医学美容（海德路店)",
            "红妆尚医学美容（京华城店）",
            "红妆尚医学美容（海府店）"
        ]
    },

    "河北省": {
        "瑞蓝": [
            "石家庄雅芳亚医疗美容医院",
            "石家庄美联臣整形美容医院",
            "石家庄星源医疗美容医院",
            "唐山美联臣医疗美容医院"
        ],
        "乔雅登": [
            "石家庄美联臣整形美容医院",
            "保定市竞秀区蓝山医疗美容医院",
            "保定京都医学美容医院",
            "承德玥莱美医疗美容医院",
            "石家庄美莱医学美容医院",
            "唐山金荣医院",
            "保定珍润医疗美容医院",
            "石家庄贵美人医疗美容医院",
            "石家庄星源美天医疗美容医院",
            "石家庄雅芳亚医疗美容医院"
        ]
    },
    
    "河南省": {
        "瑞蓝": [
            "河南整形美容医院",
            "郑州大学第五附属医院",
            "郑州大学第一附属医院",
            "河南省人民医院",
            "郑州春语医疗美容门诊",
            "商丘杜韩医疗美容门诊部",
            "郑州哈里医疗美容门诊部",
            "郑州华山医院",
            "信阳东方艺美容医院",
            "南阳时光整形美容医院",
            "郑州东方美容医院",
            "郑州金水区至美医疗美容门诊部",
            "郑州芳艺医疗美容医院"
        ],
        "乔雅登": [
            "洛阳毛大夫医疗美容",
            "孔繁荣医疗美容",
            "郑州春语医疗美容门诊",
            "郑州华山整形医院",
            "信阳东方艺美容医院",
            "郑州集美美容医院",
            "洛阳华美医疗美容医院",
            "洛阳维多利亚整形医院",
            "郑州东方整形美容医院",
            "河南整形美容医院",
            "商丘杜韩医疗美容门诊部",
            "洛阳协和整形美容"
        ],
        "法思丽": [
            "洛阳华美医疗美容医院",
            "郑州欧兰医疗美容医院",
            "中原薛正钦医疗美容门诊部",
            "中原薛正钦医疗美容门诊部",
            "商丘杜韩医疗美容门诊部",
            "南阳时光整形美容医院"
        ]
    },
    
    "黑龙江省": {
        "瑞蓝": [
            "哈尔滨伊美尔医疗整形美容医院",
            "黑龙江瑞丽整形美容医院",
            "哈尔滨医科大学附属第一医院"
        ],
        "乔雅登": [
            "黑龙江瑞丽整形美容医院",
            "哈尔滨大美医疗美容门诊部",
            "哈尔滨臻美医疗美容门诊部",
            "哈尔滨美联致美整形医院",
            "奥康医疗美容门诊",
            "黑龙江省艺星美容医院",
            "哈尔滨伊美尔医疗整形美容医院"
        ]
    },
    
    "辽宁省": {
        "瑞蓝": [
            "大连医科大学附属中心医院",
            "大连医科大学附属第一医院",
            "大连新华美天整形医院",
            "辽宁省对外贸易经济合作厅门诊部",
            "大连沙医生整形美容口腔专科医院",
            "大连艺星医疗美容医院有限公司",
            "大连爱德丽格美容有限公司沙河口医疗美容门诊部",
            "沈阳美莱医疗美容医院",
            "沈阳杏林整形外科医院",
            "沈阳和平百嘉丽医疗美容医院",
            "鞍山齐敏美容医院",
            "营口市站前协和美容医院",
            "鞍山燕丽医疗美容医院",
            "沈阳沈河美立方医疗美容门诊部",
            "沈阳和平美联致美医疗美容门诊部",
            "鞍山铁东区任凌莘医疗美容诊所",
            "鞍山铁东区张玉霞医疗美容诊所",
            "大连医科大学附属第二医院",
            "大连市皮肤病医院",
            "辽宁省人民医院",
            "中国人民解放军第202医院",
            "辽宁省中医药大学附属医院",
            "沈阳市第七人民医院"
        ],
        "乔雅登": [
            "沈阳和平百嘉丽医疗美容医院",
            "沈阳和平李淼医疗美容门诊部",
            "沈阳大东春语医疗美容门诊部",
            "沈阳丽都美容医院",
            "沈阳和平伊美尔医疗美容医院",
            "丹东金澄美容医院",
            "沈阳名流医疗美容医院",
            "锦州医疗美容医院",
            "大连康桥医疗美容门诊部",
            "大连艺星医疗美容医院",
            "辽宁协和整形外科医院",
            "大连达美元辰医疗美容诊所",
            "沈阳和平元辰医疗美容门诊部",
            "大连沙医生整形美容口腔专科医院",
            "沈阳美莱医疗美容医院",
            "大连爱德丽格医疗美容",
            "沈阳杏林整形外科医院",
            "鞍山齐敏美容医院",
            "大连新华美天整形医院"
        ],
        "法思丽": [
            "大连艺星医疗美容医院"
        ]
    },
    
    "山东省": {
        "瑞蓝": [
            "济南韩氏整形美容医院",
            "临沂V整形美容医院",
            "山东千佛山医院",
            "青岛市立医院",
            "青岛伊美尔整形美容医院",
            "青岛博士医学美容医院",
            "青岛诺德医学美容医院",
            "青岛大学附属医院",
            "山东省立医院",
            "临沂卫康医院",
            "济南伊美尔整形美容医院",
            "烟台华怡医学美容医院",
            "淄博美联臣美容医院"
        ],
        "乔雅登": [
            "济南韩式整形美容医院",
            "青岛华韩美容整形医院",
            "烟台青韩医疗美容医院",
            "威海正源整形医院",
            "临沂瑞丽整形美容医院",
            "临沂伊维美美容医院",
            "青岛芳子医疗美容",
            "市南亚美妍美容诊所",
            "青岛崂山颖逸医学美容诊所",
            "青岛妇婴医院",
            "艾美医疗美容诊所",
            "历下美莱医疗美容门诊部",
            "安吉拉医疗美容诊所",
            "济南美思慕整形美容医院",
            "济南美容整形医院",
            "济南瑞丽医疗美容医院",
            "济南艺星整形美容医院",
            "济南海峡美容整形医院",
            "济南伊美尔整形美容", 
            "济南韩美整形医院",
            "济南爱容整形美容医院",
            "临沂V整形美容医院",
            "青岛伊美尔国宾整形外科医院",
            "潍坊坤娜医疗美容医院",
            "淄博美联臣美容医院",
            "烟台华怡医学美容医院",
            "青岛诺德医学美容医院",
            "青岛博士医学美容医院"
        ],
        "法思丽": [
            "临沂微整形医院",
            "青岛伊美尔国宾整形外科医院",
            "青岛华韩整形美容医院"
        ]
    },
    
    "山西省": {
        "瑞蓝": [
            "太原华美整形医院",
            "太原丽都摩登整形美容医院",
            "太原华美整形医院",
            "太原欧美莲整形美容医院",
            "太原时光整形美容医院",
            "太原小店区美之妍医疗美容诊所",
            "临汾市尧都区佳美医疗美容门诊部"
        ],
        "乔雅登": [
            "太原丽都整形美容医院",
            "太原美媛荟整形美容医院",
            "太原华美整形医院"
        ],
        "法思丽": [
            "太原时光整形美容医院",
            "太原美媛荟整形美容医院",
            "太原欧美莲整形美容医院",
            "太原丽都莲整形美容医院",
            "太原华美整形美容医院"
        ]

    },
    
    "青海省": {
        "瑞蓝": [
            "西宁王观民医疗美容诊所"
        ],
        "乔雅登": [
            "西宁王观民医疗美容诊所",
            "西宁华美整形美容医院"
        ]

    },
    
    "宁夏回族自治区": {
        "瑞蓝": [
            "宁夏华美整形美容医院有限公司"
        ]
    },
    
    "陕西省": {
        "瑞蓝": [
            "唐都医院（整形科）",
            "西安莲湖美立方医院",
            "西安俪人医院",
            "西安艺星医疗美容医院",
            "长安医院",
            "西安美立方医疗美容医院",
            "西安美好美容医院",
            "西安雁塔女子医院",
            "西京医院"
        ],
        "乔雅登": [
            "西安美立方医疗美容医院",
            "西安雁塔春语门诊部",
            "西安艺星医疗美容医院"
        ],
        "法思丽": [
            "西安美立方医疗美容医院",
            "西安艺星医疗美容医院"
        ]
    },
    
    "新疆维吾尔自治区": {
        "瑞蓝": [
            "乌鲁木齐市华美整形美容医院",
            "新疆整形美容医院",
            "梁青松医疗美容诊所",
            "乌鲁木齐医瑞国际医学美容中心"
        ],
        "乔雅登": [
            "新疆华美整形美容医院",
            "新疆整形美容医院",
            "新疆伊丽莎白整形美容医院"
        ],
        "法思丽": [
            "乌鲁木齐华美整形美容医院"
        ]
    },
    
    "云南": {
        "瑞蓝": [
            "昆明医科大学第一附属医院",
            "昆明医科大学第二附属医院",
            "云南华美美莱美容医院",
            "曲靖华美美莱美容医院",
            "云南省第二人民医院",
            "西双版纳傣族自治州人民医院",
            "曲靖市麒麟区华美美莱医疗美容门诊部",
            "昆明丽都仁爱医疗美容医院",
            "昆明艺星医疗美容医院",
            "昆明丽都医疗美容医院"
        ],
        "乔雅登": [
            "昆明吴氏嘉美美容医院",
            "云南华美美莱美容医院",
            "延安JCI整形美容医院",
            "昆明艺星医疗美容医院",
            "昆明五华春语医疗美容诊所",
            "昆明丽都医疗美容医院"
        ],
        "法思丽": [
            "昆明吴氏嘉美美容医院",
            "昆明卓星美容医院"
        ]
    },
    
    "江西省": {
        "瑞蓝": [
            "东湖邦林医疗美容门诊部",
            "南昌美和尔医疗美容门诊部",
            "南昌佳美美容医院",
            "风华医疗美容店",
            "南昌胡博士健康咨询"
        ],
        "乔雅登": [
            "东湖博美医疗美容门诊部",
            "南昌同济美容医院",
            "赣州华美医疗美容门诊部",
            "南昌胡博士医疗美容门诊部",
            "南昌韩美美容医院",
            "南昌佳美美容医院"
        ],
        "法思丽": [
            "南昌爱思特医疗美容医院"
        ]
    },
    
    "贵州省": {
        "瑞蓝": [
            "遵义医学院附属医院美容医院",
            "贵阳美莱整形美容医院",
            "贵阳华美整形美容医院",
            "贵阳美贝尔医疗美容医院",
            "贵阳丽都医疗美容医院" 
        ],
        "乔雅登": [
            "贵阳华美整形美容医院",
            "贵阳丽都医疗美容医院",
            "贵阳利美康整形外科医院",
            "贵阳美莱整形美容医院" 
        ],
        "法思丽": [
            "贵阳颜之美医疗美容"
        ]
    },
    
    "吉林省": {
        "瑞蓝": [
            "长春中妍美容医院",
            "长春市朝阳区正韩医疗美容门诊部",
            "长春市南关区刘金梅医疗美容诊所",
            "吉林国健整形美容医院",
            "吉林铭医整形美容医院",
            "长春海峡医学美容医院",
            "长春医美美容医院",
            "吉林大学白求恩第一医院",
            "吉林大学白求恩第一医院二部",
            "吉林大学中日联谊医院"
        ],
        "乔雅登": [
            "吉林铭医整形美容医院",
            "长春奥拉克整形美容医院",
            "吉林国健整形美容医院",
            "长春海峡医学美容医院",
            "长春中妍美容医院"
        ],
        "法思丽": [
            "长春中妍美容医院"
        ]
    },
    
    "内蒙古自治区": {
        "乔雅登": [
            "内蒙古永泰整形美容医院",
            "刘露医疗美容诊所",
            "呼和浩特市京美整形",
            "包头叶子整形美容医院",
            "呼和浩特伊思整形专科医院",
            "呼和浩特诺伊美医疗美容门诊部"
        ]
    }
};