[{
        "name": "金陵女子文理学院",
        "value": 8,
        "lng": "118.7648184",
        "lat": "32.05464612",
        "coordinate": [118.764818433963, 32.0546461185639],
        "story": ["9)12月15日，日本士兵翻越金陵女子文理学院的后墙，砸开一扇门，闯入学院的医学系。由于该系在12月13日就已经将可移动的物品全部转移，所以没有东西被窃。", "2)12月15日下午4时，在金陵女子文理学院门口附近，一辆载有大米的卡车被日本士兵抢走。", "94)12月17日夜间，11名中国妇女被日本士兵强行从金陵女子文理学院的难民收容所里拖走，与此同时一支日本搜索队在一名日本军官的带领下强迫金陵女子文理学院的全体职员在学院门口排列成行，让他们在那儿站了有一个多小时。这个军官撕掉了由另外一支日本部队开具的此难民收容所已被搜查过的证明。(沃特林)", "191)1月16日，吉先生报告说，一些妇女从金陵女子文理学院回家，被日本士兵强奸，后来她们搬到金陵大学去住，因为她们羞于回到金陵女子文理学院朋友们那里。", "5)12月14日夜晚，许多人向我们诉说，日本士兵闯进中国居民的房子，强奸或强行拖走妇女。安全区内由此产生恐慌。昨天数百名妇女搬进了金陵女子文理学院的几栋建筑物，我们委员会的3名美国先生昨天夜里整夜守候在学院，保护那里的3000名妇女和儿童。", "95)12月17日，居住在金陵女子文理学院难民收容所的一个难民的儿媳妇在她的房间里遭到强奸，该学校一名教师的女儿被日本士兵拖走。(沃特林)", "300)又有妇女从金陵女子文理学院的难民收容所被人带走。(沃特林)", "173)1月1日下午，3个日本士兵闯入金陵女子文理学院楼内，其中一个到竹园里追踪一名姑娘，该姑娘便向沃特林小姐呼救。沃特林小姐及时赶到，从而制止了一起强奸事件。沃特林小姐还看见了另两名日本士兵，他们自称是宪兵队的。(沃特林)"]
    },
    {
        "name": "鼓楼西难民收容所（鼓楼广场西侧）",
        "value": 7,
        "lng": "118.778893",
        "lat": "32.06080098",
        "coordinate": [118.778892964695, 32.0608009783418],
        "story": ["1月13日21时 27岁 该妇女被一名士兵带走，次日才被放回。", "204)1月25日，难民收容所魏报告：在此我向您递交一份被强奸妇女的清单以及一根日军士兵丢下的皮带。时 间 年龄 备 注 1月13日14时 16岁 2名士兵强奸了该少女。", "1月20日晚 13岁 该女孩被一名士兵强奸。", "1月20日晚 36岁 还是这名士兵又强奸了该妇女。从下午至次日早上，该士兵奸污了3名女性。他于早上5时离开时丢下了随身携带的皮带。（签字盖章：李瑞亭，鼓楼西难民收容所负责人。）", "1月19日20时 37岁 该妇女被一名士兵强奸。", "1月13日14时 37岁 该妇女被一名士兵强奸。", "1月20日晚 48岁 同一名士兵又强奸了该妇女。"]
    },
    {
        "name": "金陵大学小桃园",
        "value": 7,
        "lng": "118.7780867",
        "lat": "32.05255921",
        "coordinate": [118.778086664586, 32.0525592072193],
        "story": ["38)12月17日，两名日本士兵爬过围墙，试图闯进委员会主席拉贝的私人住宅，当时拉贝正巧在家。见到拉贝出来，日本士兵从原路退了回去。他们声称是为了搜寻中国士兵。(拉贝)", "58)12月18日，拉贝先生报告，15名日本士兵闯进他的家。爬过围墙的日本士兵中有几个拔出刺刀逼向他的助理，抢走了他的钱和一些文件。钱是从他的西装内口袋中掏出来的。被抢劫物品的详细清单已经交给日军少佐Y．永井。拉贝先生是德国公民，而且在其住宅基地的四角插了4面标有卐字的旗帜，因此少佐发出命令(该命令贴在拉贝的院门上)，严格禁止所有日本士兵进入拉贝先生的房子。尽管如此，仍然有2名日本士兵在当天闯进拉贝先生的房子。在晚上大约6时左右，拉贝发现了他们，这2名士兵中有一人半身赤裸，正图谋强奸一名中国姑娘。拉贝先生喝令日本士兵离开院子，而且必须是从哪儿进来还从哪儿出去，也就是从围墙爬出去。", "在这前一天，日本士兵从拉贝先生的家里偷走了一辆价值300元的汽车。偷车事件发生在他不在家的时候，日本士兵没有留下像模像样的借车字据，只是留下了一张用蹩脚的英文书写的纸条，内容是“感谢你的赠送！日本皇军，K．佐藤”。(拉贝)", "76)12月19日18时，6名日本士兵趁黑爬过拉贝先生在小桃园住宅的院墙。当拉贝用手电筒照射其中一人时，此人用手枪对准拉贝，但是没有开枪，可能是他心想，枪杀一名德国人不会给他带来好结果。拉贝喝令所有6名日本士兵从院墙爬进来的地方再原路爬出去。他们试图让拉贝给他们打开大门，但是拉贝拒绝给他们这个面子，因为他们是在没有得到他的允许的情况下踏上他的宅基的。(拉贝)", "172)1月1日晚上9时，日本士兵乘坐卡车出现在拉贝先生小桃园的住宅前面要拉姑娘。因为他们被禁止进入院子和住宅，他们就继续朝大学附中开去。(拉贝)", "37)12月17日，在我的小桃园住处后面的一栋小房子里，一名妇女遭强奸并被刺伤。如果她今天能得到医治的话，或许还有救。这名妇女的母亲由于头部被击而受重伤。(拉贝)", "74)12月18日，贝茨先生在金陵大学小桃园，也就是他办公室所在地的一栋房子里发现一日本士兵，问他来干什么，他便用手枪威胁贝茨博士。(贝茨)"]
    },
    {
        "name": "汉口路小学难民收容所（汉口路）",
        "value": 4,
        "lng": "118.775427",
        "lat": "32.05577095",
        "coordinate": [118.775427031519, 32.0557709533447],
        "story": ["144)12月23日，这里人们继续遭到日本士兵的抢劫。一名喝醉了酒的士兵强奸了一名妇女，打伤了一名难民的头。日本士兵三四次闯进来劫走妇女。(五台山小学难民收容所)", "146)12月23日，下午3时，2名日本士兵闯进汉口路小学难民收容所进行抢掠，其间他们遇到了校工黄小姐，把她强奸了。这个事件当即报告了日本宪兵队特务处，该处派来几名警察，因那2名日本士兵在这期间已逃跑，警察就把姑娘带到办公室作为证人加以审问。同一晚上，另外一些日本士兵闯入难民收容所，强奸了王女士的女儿。晚上7时，又闯进3名日本士兵，强奸了2名年轻姑娘，其中一名才13岁。(郑大成，汉口路小学难民收容所所长)", "101)12月20日下午3时，3名日本军官闯入汉口路小学难民收容所办公室，工作人员试图通过翻译和日本军官交谈，但是被赶出办公室。日本军官就在这间办公室里，在光天化日之下，强奸了2名妇女。(郑大成，难民收容所负责人)", "143)12月22日，4名带着刺刀的日本士兵闯进收容所索要香烟。难民立即进行了一次小型捐款，买了7听香烟给他们。有人把前一天从这些士兵那儿得到的5元钱还给了他们。难民们之所以这样做，是因为这些士兵威胁要焚烧这栋房子。后来来了3名带枪的日本士兵索要酒。有人给他们买了2大壶酒，4名难民按照士兵们的命令把酒抬走了。另外3名日本士兵偷了3辆自行车并让3名难民把它们运走，其中只有一名难民事后返回。还有4名日本人盗了一辆人力车。另有士兵闯进难民收容所，但未造成损失。(汉口路小学难民收容所)"]
    },
    {
        "name": "金陵大学蚕厂难民收容所",
        "value": 4,
        "lng": "118.7709253",
        "lat": "32.06344113",
        "coordinate": [118.770925257391, 32.0634411280167],
        "story": ["17日上午8时，又有2辆卡车和2辆载着军官的车子开来，从蚕厂带走一些男子和7个女子。当时在场看到全过程的贝茨博士承认，这些男子和女子(其中还有一名年轻女子)是自愿一起走的。(贝茨博士)", "51)12月16日，我们一位官员马普英(音译)先生在前去安全区蚕厂(金陵大学)通知要进行搜家时，被日本士兵逮捕，虽然他带有证明他是难民收容所稽查官员的袖标和证章。另外，我们办公室一位姓王的男勤杂工也被抓走。(签名：吴国京，第六区工作人员)", "151)12月22日，2名日本士兵在金陵大学蚕厂难民收容所强奸了一名13岁的姑娘，其母亲想阻止对她女儿的奸污而被打伤。同一难民收容所中的另一名28岁的妇女也被强奸。12月23日，清晨4时，日本士兵在强行抢拉2名姑娘时被制止。士兵随即逃跑。(H．K．吴，警官)", "117)12月19日，据金陵大学蚕厂的难民收容所报告，昨天晚上8时到今天凌晨1时，共有8名妇女被强奸，其中一人被刺刀刺伤，还有4名试图保护自己妻子的男子也被刺刀刺伤。妇女被强行拖走，以后则是单独回来的。(吴国京，第六区)"]
    },
    {
        "name": "金陵神学院（大锏银巷17号)",
        "value": 3,
        "lng": "118.7728639",
        "lat": "32.04646022",
        "coordinate": [118.772863914691, 32.0464602199805],
        "story": ["201)1月20日，有3名妇女从金陵神学院被人带走。(索恩)", "264)2月1日晚上11时，3个日本士兵越过金陵神学院的院墙，从一草棚里拖出一个姑娘，姑娘逃脱了并大声呼救。难民收容所里的难民被惊醒，慌忙跑出草棚，大声喊叫，迫使日本士兵翻墙而逃。(索恩)", "347)1月30日，叶太大在金陵神学院被日本士兵强奸了。"]
    },
    {
        "name": "陆军大学难民收容所",
        "value": 5,
        "lng": "118.7778378",
        "lat": "32.05823618",
        "coordinate": [118.777837818317, 32.0582361822117],
        "story": ["12月17日和18日又分别有26名男子和30名男子被带走。被偷走的财物有：钱、行李、一袋米和400套医院的被子。一名25岁的中国男子遭杀害，一名老妇遭严重殴打倒地，20分钟后死亡。(单渊宽)", "57)12月16日，7名16岁～21岁的姑娘被从陆军大学的宿舍抓走，其中5个人被放了回来。根据姑娘们12月18日的报告，她们每天遭强奸6次～7次。(单渊宽)", "86)12月17日，Y．H．邵(基督教青年会行政秘书处)家的3个姑娘被强行从陆军大学拉出来，然后被拖到国府路，遭日本士兵强奸，到午夜时分才被放回。(陈新裕＜音译＞，基督教青年会行政秘书处)", "62)12月18日，陆军大学的难民收容所传来以下报告：12月16日，有200名男子被强行带走，回来时仅剩5人。"]
    },
    {
        "name": "大学附中",
        "value": 5,
        "lng": "118.7767952",
        "lat": "32.05033424",
        "coordinate": [118.77679521853, 32.0503342419214],
        "story": ["61)12月19日上午10时，我和贝茨博士以及菲奇先生向田中先生通报完日本士兵的暴行后，去了大学附中，打算了解一下昨天夜里那个地方的情况。我们发现，昨天夜里有3名姑娘被拖走，其中的一名在门房就遭到了3个日本士兵的轮奸。当我们朝大门走去准备离开校园时，珀尔·吴－布洛姆莱小姐出现在大门口，她的身后跟着3名日本步兵，还有一个军曹骑在马上。我们试图挡住日本士兵，并要求布洛姆莱小姐上我们的汽车，那名日本军曹对此表示反对，并企图用马挡住我们的去路。但是他那匹没用的马害怕我们的汽车，所以我们成功地通过了大门，并带着布洛姆莱小姐来到日本大使馆，我们向日本大使馆询问，在城市的什么地方能将布洛姆莱小姐安全地安置下来。布洛姆莱小姐是在美国念的大学，掌握 omega-beta—x密码。最后她自己决定到大学医院去做辅助工作。(斯迈思)", "196)1月19日，日本领事馆警官高玉来到大学附中物色6名洗衣女工。同往常一样，他被告知，如果有妇女自愿报名，我们没有意见。可高玉提出，只有年轻妇女才在考虑范围之内。当被问及为何要年轻妇女而不是更适于洗衣的其他人时，答复是：她们还得长得漂亮。(贝茨)", "220)1月30日下午5时，一日本士兵闯入大学附中要女人，一位工人求他放弃这种想法。他走了，但从相邻的一所房子里拖出一个妇女，正好被宪兵撞着。宪兵要抓他，但直到叫来第二个宪兵帮忙才把他抓住押走。(贝茨)", "190)1月14日，一家难民从大学附中回到自己住处。途中他们办理了登记证件，将它们贴在自己大门上，据说可免受日本士兵的骚扰。然而他们到家后才1个小时，5个日本士兵即闯入他们的住房，逐出所有男子，对数名妇女进行了强奸。1月15日这家人又回到中学居住。(贝茨)", "197)1月20日，一群住在大学附中的人去升州路买米，途中遭日军士兵拦截，钱被抢走。"]
    },
    {
        "name": "五台山小学难民收容所",
        "value": 2,
        "lng": "118.770718",
        "lat": "32.0528996",
        "coordinate": [118.770718015841, 32.0528996008309],
        "story": ["45)12月17日，许多妇女被从五台山小学强行带走，遭到了通宵的强奸，第二天早晨才被释放。(王)", "141)12月21日，这一天有一名孕妇和一名年仅13岁的姑娘遭强奸，夜间2个妇女被拉走。抢劫整天都在发生，甚至床上用品也被偷走。一只放有结婚礼品、新旧字画轴的筐子同样也被抢走了。但总的说来，在日本宪兵队的告示张贴之后，局势有些好转。(五台山小学难民收容所)"]
    },
    {
        "name": "大方巷的难民收容所（大方巷东口）",
        "value": 1,
        "lng": "118.7694665",
        "lat": "32.06640946",
        "coordinate": [118.769466504514, 32.0664094556417],
        "story": ["53)12月17日下午3时，3名姑娘在大方巷的难民收容所先后被日本士兵强奸。在同一所房子里的另外一个妇女被枪弹击中，受重伤。(大方巷难民收容所)"]
    },
    {
        "name": "西门子难民收容所(广州路46号)",
        "value": 1,
        "lng": "118.7648877",
        "lat": "32.05204159",
        "coordinate": [118.764887730291, 32.0520415885857],
        "story": ["221)1月31日上午11时，一位24岁的姑娘从西门子难民收容所回家(广州路46号)，为她的叔叔准备午饭。一日本士兵尾随其后，手持刺刀威胁她，如果她不想找死，就把身子给他。(拉贝)"]
    },
    {
        "name": "圣经师资培训学校难民收容所",
        "value": 12,
        "lng": "118.7722073",
        "lat": "32.04521329",
        "coordinate": [118.772207306312, 32.0452132937111],
        "story": ["145)12月23日晚8时15分，7名日本士兵劫走了4名姑娘。", "121)12月20日晚上8时～10时，日本士兵3次来到设在圣经师资培训学校的难民收容所，每次都强行拖走3个姑娘。(里格斯)", "148)12月24日～25日间夜晚，7名日本士兵闯入圣经师资培训学校难民收容所，并在那里滞留了一整夜。", "25日早晨9时和下午2时，分别闯进4名和3名日本士兵，他们抢走衣服和钱，强奸了2名姑娘，其中一名才12岁。(圣经师资培训学校难民收容所)", "170)12月29日夜间，被派来作哨兵的一个日本士兵闯入我们大楼的一个房间，强奸了一名姑娘。在这之前的12月27日，这些哨兵中就有一人喝醉酒后表示了要姑娘的念头。福井先生12月29日被告知了这起事件，他答应在12月30日夜间撤换这些哨兵。此后，如同我们感激地看到的那样，再也没有发生骚扰。(索恩，圣经师资培训学校)", "122)12月21日，早上8时来了7名日本士兵，要求提供45名苦力和姑娘。下午2时，来了4名日本士兵找姑娘。", "下午3时30分，来了6名日本士兵和1名军官，强迫我们向他们提供10名姑娘，结果他们抢走了4名姑娘。(圣经师资培训学校难民收容所，里格斯)", "125)12月21日下午5时，日本士兵抢劫了圣经师资培训学校难民收容所内的属于外国人的许多行李。(王明德)", "12月24日早上9时，日本士兵3次闯进我们这里骚扰难民，每次有日本士兵3人～4人，下午2时，他们抢走了衣服、钱和食品。(圣经师资培训学校难民收容所)", "159)12月26日，这一天有多组三四人为一组的士兵7次闯入圣经师资培训学校，从经过前面无数次抢掠还剩有一点东西的人们那儿抢走衣服、食品和钱。他们强奸了6名妇女和一个12岁的姑娘。夜里，由12人～14人组成的人数较多的士兵队伍4次闯入，他们强奸了20名妇女。(米尔斯牧师)", "124)12月21日晚8时，在圣经师资培训学校的难民收容所，有7名妇女被日本士兵强奸。(王明德)", "142)12月22日下午2时～4时，闯进一些士兵，抢走了11条被子和较大一笔钱，总共约100元。(圣经师资培训学校)"]
    }
]