[{
        "name": "鼓楼西难民收容所（鼓楼广场西侧）",
        "value": 7,
        "lng": 118.778893,
        "lat": 32.06080098,
        "coordinate": [118.778892964695, 32.0608009783418],
        "story": ["1月13日14时 37岁 该妇女被一名士兵强奸。", "1月20日晚 48岁 同一名士兵又强奸了该妇女。", "204)1月25日，难民收容所魏报告：在此我向您递交一份被强奸妇女的清单以及一根日军士兵丢下的皮带。时 间 年龄 备 注 1月13日14时 16岁 2名士兵强奸了该少女。", "1月19日20时 37岁 该妇女被一名士兵强奸。", "1月20日晚 36岁 还是这名士兵又强奸了该妇女。从下午至次日早上，该士兵奸污了3名女性。他于早上5时离开时丢下了随身携带的皮带。（签字盖章：李瑞亭，鼓楼西难民收容所负责人。）", "1月20日晚 13岁 该女孩被一名士兵强奸。", "1月13日21时 27岁 该妇女被一名士兵带走，次日才被放回。"]
    },
    {
        "name": "金陵大学蚕厂难民收容所",
        "value": 4,
        "lng": 118.7709253,
        "lat": 32.06344113,
        "coordinate": [118.770925257391, 32.0634411280167],
        "story": ["151)12月22日，2名日本士兵在金陵大学蚕厂难民收容所强奸了一名13岁的姑娘，其母亲想阻止对她女儿的奸污而被打伤。同一难民收容所中的另一名28岁的妇女也被强奸。12月23日，清晨4时，日本士兵在强行抢拉2名姑娘时被制止。士兵随即逃跑。(H．K．吴，警官)", "51)12月16日，我们一位官员马普英(音译)先生在前去安全区蚕厂(金陵大学)通知要进行搜家时，被日本士兵逮捕，虽然他带有证明他是难民收容所稽查官员的袖标和证章。另外，我们办公室一位姓王的男勤杂工也被抓走。(签名：吴国京，第六区工作人员)", "117)12月19日，据金陵大学蚕厂的难民收容所报告，昨天晚上8时到今天凌晨1时，共有8名妇女被强奸，其中一人被刺刀刺伤，还有4名试图保护自己妻子的男子也被刺刀刺伤。妇女被强行拖走，以后则是单独回来的。(吴国京，第六区)", "17日上午8时，又有2辆卡车和2辆载着军官的车子开来，从蚕厂带走一些男子和7个女子。当时在场看到全过程的贝茨博士承认，这些男子和女子(其中还有一名年轻女子)是自愿一起走的。(贝茨博士)"]
    },
    {
        "name": "汉口路小学难民收容所（汉口路）",
        "value": 4,
        "lng": 118.775427,
        "lat": 32.05577095,
        "coordinate": [118.775427031519, 32.0557709533447],
        "story": ["146)12月23日，下午3时，2名日本士兵闯进汉口路小学难民收容所进行抢掠，其间他们遇到了校工黄小姐，把她强奸了。这个事件当即报告了日本宪兵队特务处，该处派来几名警察，因那2名日本士兵在这期间已逃跑，警察就把姑娘带到办公室作为证人加以审问。同一晚上，另外一些日本士兵闯入难民收容所，强奸了王女士的女儿。晚上7时，又闯进3名日本士兵，强奸了2名年轻姑娘，其中一名才13岁。(郑大成，汉口路小学难民收容所所长)", "143)12月22日，4名带着刺刀的日本士兵闯进收容所索要香烟。难民立即进行了一次小型捐款，买了7听香烟给他们。有人把前一天从这些士兵那儿得到的5元钱还给了他们。难民们之所以这样做，是因为这些士兵威胁要焚烧这栋房子。后来来了3名带枪的日本士兵索要酒。有人给他们买了2大壶酒，4名难民按照士兵们的命令把酒抬走了。另外3名日本士兵偷了3辆自行车并让3名难民把它们运走，其中只有一名难民事后返回。还有4名日本人盗了一辆人力车。另有士兵闯进难民收容所，但未造成损失。(汉口路小学难民收容所)", "144)12月23日，这里人们继续遭到日本士兵的抢劫。一名喝醉了酒的士兵强奸了一名妇女，打伤了一名难民的头。日本士兵三四次闯进来劫走妇女。(五台山小学难民收容所)", "101)12月20日下午3时，3名日本军官闯入汉口路小学难民收容所办公室，工作人员试图通过翻译和日本军官交谈，但是被赶出办公室。日本军官就在这间办公室里，在光天化日之下，强奸了2名妇女。(郑大成，难民收容所负责人)"]
    },
    {
        "name": "陆军大学难民收容所",
        "value": 5,
        "lng": 118.7778378,
        "lat": 32.05823618,
        "coordinate": [118.777837818317, 32.0582361822117],
        "story": ["62)12月18日，陆军大学的难民收容所传来以下报告：12月16日，有200名男子被强行带走，回来时仅剩5人。", "86)12月17日，Y．H．邵(基督教青年会行政秘书处)家的3个姑娘被强行从陆军大学拉出来，然后被拖到国府路，遭日本士兵强奸，到午夜时分才被放回。(陈新裕＜音译＞，基督教青年会行政秘书处)", "12月17日和18日又分别有26名男子和30名男子被带走。被偷走的财物有：钱、行李、一袋米和400套医院的被子。一名25岁的中国男子遭杀害，一名老妇遭严重殴打倒地，20分钟后死亡。(单渊宽)", "57)12月16日，7名16岁～21岁的姑娘被从陆军大学的宿舍抓走，其中5个人被放了回来。根据姑娘们12月18日的报告，她们每天遭强奸6次～7次。(单渊宽)"]
    },
    {
        "name": "金陵女子文理学院（宁海路南端西侧）",
        "value": 8,
        "lng": 118.7653724,
        "lat": 32.06035079,
        "coordinate": [118.765372357144, 32.0603507898306],
        "story": ["5)12月14日夜晚，许多人向我们诉说，日本士兵闯进中国居民的房子，强奸或强行拖走妇女。安全区内由此产生恐慌。昨天数百名妇女搬进了金陵女子文理学院的几栋建筑物，我们委员会的3名美国先生昨天夜里整夜守候在学院，保护那里的3000名妇女和儿童。", "173)1月1日下午，3个日本士兵闯入金陵女子文理学院楼内，其中一个到竹园里追踪一名姑娘，该姑娘便向沃特林小姐呼救。沃特林小姐及时赶到，从而制止了一起强奸事件。沃特林小姐还看见了另两名日本士兵，他们自称是宪兵队的。(沃特林)", "94)12月17日夜间，11名中国妇女被日本士兵强行从金陵女子文理学院的难民收容所里拖走，与此同时一支日本搜索队在一名日本军官的带领下强迫金陵女子文理学院的全体职员在学院门口排列成行，让他们在那儿站了有一个多小时。这个军官撕掉了由另外一支日本部队开具的此难民收容所已被搜查过的证明。(沃特林)", "95)12月17日，居住在金陵女子文理学院难民收容所的一个难民的儿媳妇在她的房间里遭到强奸，该学校一名教师的女儿被日本士兵拖走。(沃特林)", "191)1月16日，吉先生报告说，一些妇女从金陵女子文理学院回家，被日本士兵强奸，后来她们搬到金陵大学去住，因为她们羞于回到金陵女子文理学院朋友们那里。", "9)12月15日，日本士兵翻越金陵女子文理学院的后墙，砸开一扇门，闯入学院的医学系。由于该系在12月13日就已经将可移动的物品全部转移，所以没有东西被窃。", "2)12月15日下午4时，在金陵女子文理学院门口附近，一辆载有大米的卡车被日本士兵抢走。", "300)又有妇女从金陵女子文理学院的难民收容所被人带走。(沃特林)"]
    },
    {
        "name": "五台山小学难民收容所",
        "value": 2,
        "lng": 118.770718,
        "lat": 32.0528996,
        "coordinate": [118.770718015841, 32.0528996008309],
        "story": ["45)12月17日，许多妇女被从五台山小学强行带走，遭到了通宵的强奸，第二天早晨才被释放。(王)", "141)12月21日，这一天有一名孕妇和一名年仅13岁的姑娘遭强奸，夜间2个妇女被拉走。抢劫整天都在发生，甚至床上用品也被偷走。一只放有结婚礼品、新旧字画轴的筐子同样也被抢走了。但总的说来，在日本宪兵队的告示张贴之后，局势有些好转。(五台山小学难民收容所)"]
    },
    {
        "name": "大方巷的难民收容所（大方巷东口）",
        "value": 1,
        "lng": 118.7694665,
        "lat": 32.06640946,
        "coordinate": [118.769466504514, 32.0664094556417],
        "story": ["53)12月17日下午3时，3名姑娘在大方巷的难民收容所先后被日本士兵强奸。在同一所房子里的另外一个妇女被枪弹击中，受重伤。(大方巷难民收容所)"]
    },
    {
        "name": "西门子难民收容所(广州路46号)",
        "value": 1,
        "lng": 118.7648877,
        "lat": 32.05204159,
        "coordinate": [118.764887730291, 32.0520415885857],
        "story": ["221)1月31日上午11时，一位24岁的姑娘从西门子难民收容所回家(广州路46号)，为她的叔叔准备午饭。一日本士兵尾随其后，手持刺刀威胁她，如果她不想找死，就把身子给他。(拉贝)"]
    }
]