/*
 * Yuan Ren｜任远
 * 财新数据新闻与可视化实验室 | Data Journalism & Visualization Lab
 * 2014 10 23
 */


var PList = [{ id: "P0", name: "周永康", photo: "周永康.jpg", information: "前中共中央政治局常委，中央政法委书记，出生于1942年。/周永康2007年-2012年任中共中央政治局常委，从权力巅峰引退刚刚一年，就成为中共建政以来第一位因经济腐败落马的前政治局常委。一起倒下的，是一个涉黑贪腐集团，至少包括两名十八大中央委员、两名候补中央委员、三名副省部级以上高官，数百名公务人员、国企和私营企业负责人，以及周永康的绝大部分近亲属。/周永康少时家贫，但读书刻苦，成绩也好。同学印象中的周永康“热情客气，经常笑，憨厚”。/1961年，周永康考上北京石油学院。毕业后被分配至大庆油田六七三厂，即辽河油田前身，从实习员、技术员做起。在辽河油田的18年，周永康的口碑不错，上升很快，差不多一两年一个台阶。老同事说“他不抽烟，不喝酒，生活相当简朴。常常一身劳动布衣裤，膝盖前面两块补丁”。/1983年，周永康被擢升为辽河石油勘探局局长、党委副书记。1984年，辽河油田所在地盘锦正式建市，周永康兼任盘锦市委副书记、市长，集油田、地方大权于一身。/1985年，43岁的周永康从盘锦来到北京，担任石油工业部副部长。/1988年，周永康出任中国石油天然气总公司副总经理。/1996年12月，周永康接任中石油总公司总经理和党组书记。1997年中共十五大上，周永康第一次被选进中共中央委员会。/1998年3月，周永康担任第一任国土资源部部长。次年12月赴四川就任省委书记。/2002年十六大，周永康当选中央政治局委员，赴京担任公安部长、中央政法委员会副主任。/2007年十七大上周永康入常，并出任中央政法委员会书记，中央社会治安综合治理委员会主任。/2012年十八大，周永康卸任。" }, { id: "P1", name: "周滨", photo: "", information: "周永康长子，出生于1972年。/曾任北京中旭阳光能源科技股份有限公司董事长，从事倒卖油田及油井设备、能源信息化生意，亦以妻子黄婉、岳母詹敏利的名义参股四川商人吴兵、刘汉等的旅游和水电开发，并与白手套米晓东一起涉足北京房地产生意。周滨“身材高大，眼睛细长”，本科毕业于西南石油大学，与落马的中石油高管李华林、王道富和冉新权等是校友。周滨1993年前后赴石油公司聚集的美国德州大学达拉斯分校攻读石油相关专业的研究生学位,他还持有美国飞机驾驶牌（FAA牌照）。/周滨的大学同学称，周滨在美国留学期间就开始做些生意，比如通过关系将外资的石油设备卖给中国的石油企业，令同学们“羡慕不已”。不过，周滨还是顺利毕业，甚至获得了荣誉学生的奖励。/在德州，周滨遇到了后来的妻子黄婉。两人婚后育有两个孩子。2001年后，周滨夫妇将重心转移到国内。周滨回国后曾在全球知名的油田服务公司斯伦贝谢供职，当时他的名片职务是“工程师”。/知情人士称“2003年前后，周滨开始创立自己的公司。当时的印象还比较低调、随和”。/周滨不是一个成功的企业家，他的主要生意方式是以低价获得稀缺资源和合同，然后再高价卖出——这种方式在计划经济时代被称为“投机倒把”，1980年代后成为一种“官二代”常见的商业盈利模式。/周滨曾在2007年前后以一两千万元低价获得长庆油田高产区块，转手倒卖获得5.5亿元暴利。这也成为中石油高管落马的重要线索。/“倒卖油田这种事，都是拼背景，但是谁有周滨硬呢？我们最后只能甘拜下风。”一位曾经与周滨竞争同一项目的人士向财新记者说到。/2009年底，周滨受让其岳母詹敏利持有的中旭阳光石油天然气科技有限公司1600万元股权。2010年2月，中旭阳光改制为股份公司，周滨持2400万股占80%，担任董事长。2012年12月，周滨不再担任董事，变为其妻黄婉，并由黄婉出任董事长。中旭阳光只是周滨夫妇投资的公司之一，周滨也经常往来香港等地，照顾其他生意。" }, { id: "P2", name: "贾晓晔", photo: "", information: "周永康现任妻子，出生于1968年，曾在央视二套财经频道工作过。/贾晓晔老家在山西，大学毕业后，贾晓晔进入央视做记者，从而有机会采访周永康。周永康担任四川省委书记后，贾晓晔很低调地嫁给了周。/2002年10月，周永康返回北京，在十七大上当选中央政治局委员，出任中共中央政法委员会副书记、公安部部长，贾也回到央视工作。/贾晓晔因为周永康腐败案同样正在接受调查，主要涉嫌利用丈夫的影响力买官卖官。“在山西当地，要想升官找贾晓晔”，这是很多官场人物知道的秘密。据悉吕梁市长丁雪峰就是通过贾晓晔买官，于2013年12月底被带走调查。" }, { id: "P3", name: "周涵", photo: "", information: "曾用名周寒，周永康次子，出生于1975年。/中石油北京油气调控中心党委办主任。周涵和哥哥周滨一样，也曾在美国得州短暂待过。他是中国石油大学（北京）硕士研究生，高级工程师，在中石油北京油气调控中心担任党委办公室主任，一名处级干部。由于父母离异且母亲很快去世，周涵与父亲关系不好，更多时间花在工作上，多次发表石油工程、通信、安全管理方面的学术文章，曾获得中国石油油气管道通信传输网优化研究二等奖。/不过周永康和周滨显然并不希望周涵就此疏远这个家庭，而是将其保护在一个合适的距离。2010年2月春节前夕，时任中共中央政治局常委周永康到中石油、国家电网和铁道部，考察重点行业企业安全运行和维护稳定工作，首先来到的就是周涵工作的部门。/周涵的直接上司张伟及其妻子朱莉萍都是周滨的生意圈中人。/接近中石油的权威消息人士称，周涵目前也已“失去联系”。" }, { id: "P4", name: "黄婉", photo: "", information: "周永康儿媳，周滨之妻，北京中旭阳光能源科技股份有限公司董事长，出生于1971年。/黄婉，英文名Fiona，黄渝生与詹敏利的女儿，1980年代随父母移居美国。黄婉眼睛大，眉目清晰，比其夫周滨大半岁，二人在美国得克萨斯相遇，婚后俩人育有两名子女。/2001年后，周滨和黄婉的地址都变更为黄婉家人所居住的新泽西州。当时，周滨夫妇已经将重心转移到国内，并经常居住在北京。2012年12月，黄婉接替周滨出任中旭阳光石油天然气科技有限公司董事长，这家公司只是周滨夫妇投资的众多公司之一。" }, { id: "P5", name: "黄渝生", photo: "黄渝生.jpg", information: "周永康亲家公，黄婉之父，出生于1944年。/曾任北京中旭阳光能源科技股份有限公司董事、美国海思科公司主席、美国Newrun International公司主席。黄渝生在重庆北碚出生，毕业于北京对外贸易学院，其父是在中国著名地质学家黄汲清。黄渝生1986年赴美，最早生活在马里兰州的盖茨堡市。1990年代初期，他带着家人迁往新泽西州伊弗珊乡马尔顿地区。在这里，黄渝生以自己名字的三个首写字母，注册成立了海斯科公司（Hysco Corporation）。/1993年7月，黄渝生回到北京。此后，他与妻子詹敏利成立了北京海斯科投资顾问有限公司。2010年，黄渝生进入中旭阳光石油天然气科技有限公司董事会，这家公司由其妻詹敏利于2004年与他人合资成立。黄渝生的女婿周滨和女儿黄婉后来相继出任这家公司的董事长。" }, { id: "P6", name: "詹敏利", photo: "詹敏利.jpg", information: "周永康亲家母，黄婉之母，出生与1942年。/曾任北京中旭阳光石油天然气科技有限公司大股东、四川天丰水利资源开发有限公司大股东。詹敏利比丈夫黄渝生大两岁，英文名Mary Zhan。黄渝生担任海斯科公司主席时，詹敏利担任副主席。2004年，北京中旭阳光石油天然气科技有限公司成立，注册资金500万元，之后曾增资，大股东一直是詹敏利。2003年8月，詹敏利还成立过一家北京中旭阳光科技发展有限公司，注册资金100万元，2006年7月注销。/2009年底，中旭阳光石油天然气科技有限公司股东大会决定，詹敏利将1600万元股权转让给周滨。2010年2月，中旭阳光改制为股份公司，周滨持2400万股占80%，担任董事长一职，黄渝生亦进入董事会，詹敏利为监事。" }, { id: "P7", name: "贾晓霞", photo: "", information: "贾晓晔之妹，曾任中油国际加拿大公司总经理。/贾晓霞颧骨较高，细眉细眼，曾就读于复旦大学外语学院。受周永康的荫护，贾晓霞也进入石油系统，先后在中石油厄瓜多尔和加拿大分公司工作。/在石油公司聚集的加拿大卡尔加里，贾晓霞颇为活跃。她以玛格丽特·贾的英文名字，和中油国际加拿大公司总经理的身份，与中海油加拿大有限公司CEO、中石化国际石油勘探加拿大公司总经理等人并列加拿大中国商会（Canada China Chamber of Commerce）董事会。/公开资料可以查到，贾晓霞2013年2月21日在世界妇女论坛（IWF）加拿大卡尔加里分会举办的活动中做了即兴发言，同年6月19日还在卡尔加里举办的第一届加中石油天然气研讨会上致开幕词。/目前贾晓霞仍滞留在加拿大。2014年春节期间的2月3日，她以中油国际加拿大公司总经理的身份向卡尔加里的皇家山大学（Mount Royal University）捐赠了两个乒乓球桌，并与学校校长戴维·多切蒂（David Docherty）打了一场乒乓球赛。" }, { id: "P8", name: "周元兴", photo: "", information: "周永康二弟，已故。/周元兴初中毕业后在乡务农。在兄弟相继发迹之后，周元兴家也迅速脱胎换骨。/乡人称周元兴从前抽的是两块五的烟，打5毛钱的麻将，两圈牌打下来，就输得拿不出钱来，“现在不得了，他抽的是软中华，吃的老酒是五粮液，要吃多少有多少。”有人曾经去他家，看到五粮液很多，茅台很多，香烟很多。还有三块翡翠，都是五公斤一块，其中一块雕佛，一块雕鹰。/周元兴父子曾是五粮液的代理商，乡人说这给周元兴带来滚滚财源，“不出门就可以赚钞票”。村民称周家发家的另一路径，是替人“平事”，“比如有人要安排工作，企业有事情搞不定了，他去说合。”随着周永康权势日长，周家的“公关”生意，还包括了替人在打官司时说情和捞人。该项收费的价格不菲。知情者透露，无锡某镇党委书记出事，面临判刑，亲戚到周家去求，周家开价15万，还不打包票。周家的业务还包括向江苏某警校输送学生。学生的成绩达不到录取线，周家父子去讲讲情，就送进去了。/周元兴的儿子周晓华经常开一辆车牌尾号为001的车子，出现在厚桥镇上，大伯父步步高升，周晓华在当地也被戏称为“部长”。/2013年秋，周元兴查出骨癌。/村民称，周元兴病危之时曾留悔言：“金山银山有什么用，我现在最伤心的，是见不到哥哥，见不到弟弟，打个电话都打不通，拿那么多钞票有什么用？”/2014年春节过后，虚岁七十的周元兴在家中病逝。" }, { id: "P9", name: "周元青", photo: "", information: "周永康三弟/周元青当过大队支书，又娶了官员之女周玲英。因此周元青也走上了仕途.他从大队书记做到无锡县厚桥镇副镇长，后落选，被调往其他镇任职。1995年6月，无锡县撤销，设锡山市，周元青曾任锡山市经济技术协作办公室主任。2000年12月，锡山市拆分为锡山区和惠山区，周元青成为惠山区国土局副局长。/身在官场的周元青，成为当地一些官员攀龙附凤的桥梁，进京拜见周家大哥，多是周元青陪同。周元青家的产业涉足奥迪4S店、与中石油合伙做液化气生意、开矿等，但这些产业均由其妻和其子出面掌控。" }, { id: "P10", name: "周玲英", photo: "", information: "周永康三弟媳，北京宏汉实际控制人，鸿丰钾矿大股东。江阴奔跃奥迪4S店老板，与中石油旗下昆仑能源合资成立无锡中油，销售液化天然气。/周玲英个矮，人称“矮玲英”，是无锡锡山区厚桥街道的西前头村北安乐桥人。其父做过无锡县坊前镇党委书记、无锡县商业局长。丈夫周元青是惠山区国土局副局长，周玲英则长袖善舞。她先在厚桥供销社做营业员，后去厚桥食品站，做过站长，再调至无锡县食品公司。近些年，周玲英和儿子周峰开始开公司，住到无锡市区一栋复式住宅里。尽管很少能看到他们回乡，但关于周玲英等人开矿、卖消防器材、替油田采购设备、在全国有3000加油站等传闻，混杂着村民对周家财富的想象，在厚桥漫天飞，真假难辨。/2007年12月，周玲英出资5000万元，成立北京宏汉投资有限公司。数年内，该公司先后投资了北京宏元达投资发展有限公司、北京瑞丰勘查有限责任公司、北京信远宏大投资有限公司、北京鸿丰投资股份有限公司。/北京鸿丰投资和中石油四川石油管理局旗下的四川华油共同出资设立四川邛崃市鸿丰钾矿肥有限公司。2011年，鸿丰钾肥被置入成都高投集团控股的上市公司高新发展（000628.SZ），鸿丰钾肥的资产预估中，无形资产一项的账目价值为5071.25万元，预估的价值却到了7.6亿元，最为核心的增值资产是平落坝的采矿权。/2010年2月，周玲英出资1900万元成立江阴奔跃，占股95%，这是江阴市唯一的奥迪4S经销商。北京一位汽车经销商说，“（奥迪4s店）不是有钱就能开的，你的关系得足够有撼动力，甚至据说大众中国和奥迪中国的高层都插不上手。”/2012年，由昆仑能源控股97.26%的新疆新捷股份公司在江苏成立江苏中油昆仑能源投资有限公司（下称江苏中油）；2012年11月，江阴奔跃与江苏中油合资成立无锡中油昆仑能源有限公司，江阴奔跃占49%的股份。但无锡中油尚未开展业务，周永康与中石油系便已案发。" }, { id: "P11", name: "周锋", photo: "", information: "曾用名周峰，周元青之子，北京宏汉董事长。/2004年，周家三房独子周峰从日本学成回国。周峰是周家下一代的“麒麟儿”，他不仅拿到了日本知名私立大学中央大学的经济学硕士学位，还在日本最大的综合商社三菱商事有三年从商经验。/不过与大房堂兄周滨类似，周峰做生意也是低买高卖、快进快出，少有实业致富的耐心。周峰是其母周玲英出资的北京宏汉的董事长。在北京宏汉的工商资料中，周峰使用的是身份证名是“周锋”。/2010年，宏汉系旗下的一家公司与成都市青白江区政府签约，在青白江区集装箱物流园区兴建宏聚建材城，项目总投资7亿元，总用地面积714亩。仅两个月后，这家公司的95%股权就被转让给四川英祥集团。2013年12月，青白江区原区委书记孙建成正因此项目而落马。" }, { id: "P12", name: "米晓东", photo: "", information: "原中国海洋石油总公司干部，周滨白手套，负责打理周家在海油和陆上油田买卖的生意，2013年9月底被带走调查，亦代表周滨在北京北五环承包300亩土地，出生于1970年。/米晓东与周滨是校友，俩人都毕业于西南石油大学。1970年5月出生的米晓东，是老海油子弟，在湛江的中海油南海西部公司家属院长大，从西南石油大学毕业后到中海油南海东部公司工作。2005年前后米晓东离开南海东部公司后在深圳的一家外资石油公司短期供职，2006年前后到北京，与周滨合伙做生意。2007年，米晓东和詹敏利等人在西安分别成立了陕西德淦石油科技有限公司和陕西秋海汲清石油科技有限公司，通过这两家公司取得中石油长庆油田的两个高产区块，并转手倒卖，获利数十倍。" }, { id: "P13", name: "吴兵", photo: "吴兵.jpg", information: "又名吴永富，出生于1963年，中旭（香港）有限公司董事长，周滨白手套，负责打理周家水利、高速公路以及影视等生意，2013年8月在北京西客站被带走调查。/吴兵生于成都，从1997年开始即持有来往港澳通行证，吴兵是他在香港身份证的名字，对应在中国内地的户籍系统中，他是吴永富。吴兵的香港身份证号又与一个名叫“李若尘”的人相同。/在成都，吴兵是中旭投资有限公司董事长，主要从事水电站、高速公路等基础设施投资，曾拥有总装机70万千瓦、投资53亿元的大渡河龙头石水电站和总装机45万千瓦、投资32亿元的革什扎水电站；他的另一家公司——中旭盛世风华投资有限公司注册在北京，从事影视投资。在北京，两家名称冠以中旭阳光的能源科技和石油服务公司，亦在石油信息化和石油钻采设备维修领域获得大单。吴兵旗下的水电站能从央企口中夺水头，文化娱乐公司走红色路线。吴兵早年间在成都还开发过文殊芳园等一些小楼盘。这些项目从外面看其貌不扬，内里装修却很高档，早年间文殊芳园开发建成后，一些政法领域官员入住其中，房屋产权往往登记在家属名下。2012年底四川官商窝案爆发后，有些房屋又通过二手房交易方式转让回吴兵家族成员名下。" }, { id: "P14", name: "蒋洁敏", photo: "蒋洁敏.jpg", information: "出生于1955年，原国务院国资委主任，2013年9月被查。曾任中石油集团总经理，周永康在石油系主要部属。/蒋洁敏的40年石油生涯起步于胜利油田，从技术员到中石油集团董事长，共用了35年。2013年9月初，蒋洁敏在出任国务院国资委主任半年后落马，在此前后中石油系统多名高管先后被查。/蒋洁敏与周永康第一次有交集是在周担任胜利油田兼任管理局党委书记、局长期间。当时油田出了五大“工人领袖”，出身孤岛采油厂的蒋洁敏是其中之一。/蒋洁敏与周永康的大秘郭永祥是山东同乡。1972年12月两人同一批招工入胜利油田，而且一起分到了孤岛采油厂。蒋洁敏小郭永祥5岁，郭永祥调到胜利油田党委办公室当秘书后，对蒋洁敏多有照拂。在周永康离开中石油，需要在中石油内部找代理人，而蒋洁敏谋求上位，需要奥援震慑中石油大小山头的时刻，郭永祥也起到了关键性的桥梁、润滑和黏合作用。/1999年，蒋洁敏从青海石油管理局调任中石油集团总经理助理，以上市筹备组组长的身份，参与领导了中石油的公司化改革和海外IPO上市。1999年11月5日，中石油股份有限公司组建完成，蒋洁敏出任董事兼副总裁。2000年4月7日，中石油在香港上市，跻身世界石油大公司十强行列。/2003年12月23日，重庆开县井喷事故发生，当时的中石油集团总经理马富才引咎辞职。2004年4月，蒋洁敏担任集团副总经理和党组副书记。2006年年底，蒋洁敏全面接手中石油。/中石油的明星是长庆油田，而中石油高层被查的一个重要线索就是长庆油田的对外合作开发问题，“蒋洁敏2006年11月当集团总经理后，将长庆油田的两个‘相差很大’的区块‘换包’，批给相关人对外合作。当时相关副总也签字了，但写的是按照蒋总的批示办”。这里的“对外合作”方就是周滨和米晓东的公司。周滨曾在2007年前后以一两千万元低价获得长庆油田高产区块，转手倒卖获得5.5亿元暴利。" }, { id: "P15", name: "李华林", photo: "李华林.jpg", information: "出生于1962年，周永康前秘书（中石油时期，1988-1992年），原中石油集团党组成员、副总经理，2013年8月被查。/1988年，原石油部改组为中国石油天然气总公司，周永康任副总经理兼党组副书记。当年12月，西南石油大学物探系毕业的25岁干部李华林，从中石油开发生产局调到办公厅秘书处，担任周的专职秘书。一直到1992年3月，李华林被派往中石油休斯顿办事处任副主任。1995年5月，李华林任中国石油天然气总公司勘探开发公司副总经理兼中油国际加拿大公司总经理，2006年7月起任深圳石油实业有限公司董事长兼中国石油天然气香港有限公司总经理；2007年1月获委中石油旗下香港上市公司昆仑能源董事局主席，11月起被聘为中国石油天然气股份公司副总裁兼中国石油天然气香港有限公司总经理。 /2013年7月29日，李华林被公布获任中石油副总经理、党组成员；8月24日还参加了中石油集团党组成员到西柏坡的参观学习，8月27日，国务院国资委纪委宣布李华林涉嫌严重违纪，接受组织调查。" }, { id: "P16", name: "王永春", photo: "王永春.jpg", information: "原中石油集团党组成员、副总经理、大庆油田总经理，中共十八大候补中央委员。2013年8月被调查。/于2008年起执掌大庆油田的中石油集团副总经理王永春，不仅在2012年十八大上晋身中央候补委员，2013年3月蒋洁敏调任国务院国资委主任后，他也曾被视为总经理接班人之一。但王永春还在吉林油田担任总经理时，口碑就不甚佳。一位民营石油企业家向财新记者透露，王曾邀请他合作开发吉林油田的区块，“但他话里话外让我送钱，我只好敬而远之”。" }, { id: "P17", name: "冉新权", photo: "冉新权.jpg", information: "原中石油股份公司副总裁、长庆油田总经理，2013年8月接受调查。/冉新权算得上年轻有为，2002年37岁时，即担任中石油股份公司勘探与生产分公司副总经理。2005年2月冉新权调到长庆油田分公司，2008年2月起任总经理，2011年起兼任中石油股份公司董事、副总裁。冉新权拥有博士和教授级高级工程师头衔。/冉新权和王道富两人执掌长庆油田十年期间，油气储量和产量增长迅速，不过，两人在长庆油田内部批评甚多。一名长庆油田的员工曾写到：“使劲地上产，可以说达到了竭泽而渔的地步，表面上看加速了长庆的发展，实际上加速了长庆油田的衰落，对几万长庆人及其后代来说，这绝不是什么好事。”" }, { id: "P18", name: "王道富", photo: "王道富.jpg", information: "原中石油股份公司总地质师、长庆油田总经理，2013年8月接受调查。/王道富1982年在长庆油田参加工作，曾任长庆石油勘探局开发处处长等职，1999年9月起任长庆油田分公司副总经理，2003年1月任长庆油田分公司总经理，2005年获全国劳动模范称号，2008年当选全国人大代表，2008年5月起被聘任为中石油股份公司的总地质师。/王道富和冉新权两人执掌长庆油田十年期间，油气储量和产量增长迅速，不过，两人在长庆油田内部批评甚多。一名长庆油田的员工曾写到：“使劲地上产，可以说达到了竭泽而渔的地步，表面上看加速了长庆的发展，实际上加速了长庆油田的衰落，对几万长庆人及其后代来说，这绝不是什么好事。”" }, { id: "P19", name: "温青山", photo: "温青山.jpg", information: "原中石油集团党组成员、总会计师，2013年12月13日被带走调查。/" }, { id: "P20", name: "沈定成", photo: "", information: "中国联合石油公司原党委书记，2014年初被查，曾任周永康秘书（中石油时期1992-1998年）。/沈定成1983年毕业于西南石油大学油气储运专业，1992-1998年期间任周永康秘书。1998年，周永康告别31年的石油生涯，受命组建国土资源部并任部长，他将沈定成留在中石油，安排到专责油品进出口贸易的中国联合石油公司担任副总经理" }, { id: "P22", name: "李春城", photo: "李春城.jpg", information: "出生于1956年，原四川省委副书记，2012年12月6日落马。周永康在四川的主要部属。/1956年出生的李春城少年得志，哈工大毕业后留校，曾任过四年的共青团哈尔滨市委书记。1995年，39岁的李春城晋升哈尔滨市委常委，成为正局级干部。1998年12月，李春城出人意料地由哈尔滨副市长调任成都市副市长。/在成都，李春城虽然与原主要领导不和，却获得了周永康的青睐赏识。2001年5月升任成都市长。在2002年11月的中共十六大上，李春城当选中央候补委员，翌年正位成都市委书记，仕途一片看好。/2003年，李春城启动了闻名全国的城乡统筹改革，2007年获得国务院改革试点批复。有人士称，李春城在成都能做成这么大的事，也依赖周永康奠定的基础和一直以来的保驾护航，给予了宽松的政策环境。/2004年，李春城还提出建设规范化服务型政府，以及力推藏区9+3免费教育计划。成都当地一位人士认为，这些年成都经济社会发展比较好，和当时李春城主持的产业结构和社会事业体系调整很有关系。/令人惊讶的是，锋芒毕露的李春城在2007年的中共十七大上落选中央候补委员，据悉其被牵入黑龙江省政协主席韩桂芝案。李春城虽被保过关，但不得不在成都市委书记任上再蹉跎一届。/“李春城不像周永康的四个秘书，不在周的最核心圈子，但是两届市委书记，对成都的控制力极强，延续了周永康在四川的影响力。”一位四川政坛的官员说。/和其他城市一样，李春城主政的成都，也成立了几十家政府投融资平台公司，涉足旧城改造、新城建设、工业、交通、文化旅游等领域。然而，这类平台公司不仅为政府借此直接参与具体的经济活动大开其门，更为权力寻租、官商勾结的利益交换提供了丰沃土壤。这些“红顶商人”在城市土地转让和开发领域拥有的极大能量，也催生了更多“灰顶商人”乃至“黑顶商人”暴富的神话。" }, { id: "P23", name: "刘汉", photo: "刘汉.jpg", information: "出生于1965年，四川汉龙集团董事局主席，四川黑社会老大兼周家白手套，曾高价从周滨手中收购旅游资产，周滨亦曾帮其代持水电公司股权。2013年3月20日前后被警方控制，2014年2月被公诉，4月案件庭审。/2004年，刘汉从周滨夫妇手上高价购入的四川茂县的一个旅游项目，周滨由此获利上千万。汉龙集团内部人士称，刘汉做该笔交易，主要是为了维护和周滨的关系。/2006年，刘汉计划在阿坝州开三个水电站，但未获批。周滨对刘汉投桃报李，出面代为持有刘汉的兴鼎电力20%的股份。后来，该项目获批，而且申请到了6亿元的银行贷款。" }, { id: "P24", name: "冀文林", photo: "冀文林.jpg", information: "出生于1966年，周永康前秘书（国土资源部、四川省委和公安部时期，1998-2008年），海南省原副省长。2014年2月18日被证实正接受调查。他与郭永祥和李华林，曾在不同阶段担任过周永康秘书之职，也曾经是李崇禧的下属。/冀文林不仅是“十八大”后落马的第19名副部级以上官员，也是继郭永祥、李华林、沈定成之后第四位落马的周永康前任秘书。/1998年8月，周永康选择了原地矿部部长办公室副主任、和周同为物探专业的冀文林为自己新的专职秘书，并且从此将冀带在身边。2008年冀文林返回国土资源部任办公厅主任。2010年，中组部从各部委及中央直属机构选派66名司局级干部到地方任实职，当年10月，冀文林来到海南，任海口市委副书记、副市长，翌年2月当选海口市市长。2013年1月，冀文林升任海南省副省长，成为66名梯队精英中第5个晋升副部级的。/冀文林在海南的政绩还是不错的，这在很大程度上来源于他在周永康身边积累的人脉，以及石油系的协助。/2013年12月上中旬和今年1月上中旬，冀文林都有一段20天左右的时间未公开露面，曾引起协助调查的猜测。但今年1月21日出席海南省政府的一次全体会议后，冀文林的公务活动似乎恢复正常，全程参加了2月8日-13日召开的海南省“两会”。/然而自2月14日出席海南省纪委六届三次全会后仅四天，这名远在天涯海角的周派部署也告落网。" }, { id: "P25", name: "郭永祥", photo: "郭永祥.jpg", information: "出生于1949年，周前大秘书（主政国土资源部和四川时期），原四川省委常委、省委秘书长、四川副省长、四川文联主席。2013年6月被查，2014年4月被双开，并随即被最高检立案侦查。1949年出生的郭永祥是山东临邑人，在胜利油田和中石油待了26年后，1998年7月，他随周永康到新组建的国土资源部，担任办公厅主任。2000年1月，周又把他带到四川，担任省委副秘书长、秘书长、办公厅主任和常委办主任。2002年底周永康荣升政治局委员上调中央，将郭永祥留在了四川，并帮助郭永祥晋身四川省委常委。/有多年秘书经历的郭永祥一向以笑脸迎人。一位四川官方人士认为，郭永祥“一看就是官场老江湖，圆圆脸儿，见谁都笑嘻嘻的，八面玲珑。据说也很仗义，可以帮些小忙。喜欢京剧，记忆力很好，口才也佳，脱稿讲话时引经据典，思路清晰。”/“他知道领导怎么想，事情和领导怎么说能成。”另一位信源透露，郭永祥在四川官场人脉很好，可以称得上是“大哥”级人物，连成都当地的高官都把他视为大哥，“他在四川被视为周永康的眼线，在一些事情上可以牵线搭桥”。/郭永祥最成功的一次牵线搭桥，可能是为其山东同乡蒋洁敏与周永康拉上关系。1972年12月郭蒋二人同一批招工入胜利油田，而且一起分到了孤岛采油厂。郭永祥大蒋洁敏5岁，郭永祥调到胜利油田党委办公室当秘书后，对蒋洁敏多有照拂。在周永康离开中石油，需要在中石油内部找代理人，而蒋洁敏谋求上位，需要奥援震慑中石油大小山头的时刻，郭永祥在蒋与老领导之间扮演了重要的桥梁、润滑和黏合作用。/此外，在2000年后四川的水电大开发时期，汉龙集团的刘汉、中旭系的吴兵以及隐在他们身后的周滨，也纷纷加入跑马圈水的浪潮，拿走多条河流的水电开发权，郭永祥在其中亦助力甚多。/在张学忠时代，郭永祥依靠自己圆熟的手腕和笑容，继续留任了两年多省委秘书长和办公厅主任。2006年1月始担任副省长，2007年5月退出省委常委之列。2009年郭永祥年满六十，在仕途结尾，古文功底深厚、喜好文艺的他选择了省文联主席一职，当时还被传为美谈。/" }, { id: "P26", name: "李崇禧", photo: "李崇喜.jpg", information: "出生于1951年，原四川省政协主席，周永康在四川主要部属。2013年12月末被证实正接受调查。/李崇禧是土生土长的四川人，在四川上学，大学毕业后进入省纪委系统干了13年，1995年短暂到甘孜藏族自治州任职，1996年3月到阿坝藏族羌族自治州担任了四年州委书记。/周永康主政四川不久，就力排众议，接受了有人举报的李崇禧的投输靠拢，将其从阿坝州提拔到省委秘书长、办公厅主任的显位，并于同年12月再进一步，进入四川省委常委班子。2002年5月，周即将离开四川前，又力推李崇禧至四川省委副书记、省纪委书记的关键性岗位，在四川省委中的话语权大增。/加入周永康阵营后，李崇禧从2002年5月起担任了近10年省委副书记，历经周永康、张学忠、杜青林、刘奇葆等四任省委书记，其中又有五年兼任省纪委书记。/李崇禧在四川官场以喜怒不形于色著称。“他城府很深，很谨慎，不苟言笑，在纪委系统一直有很深的影响力。”一位四川官方人士称。/李春城被抓后，李崇禧还荣升省政协主席，晋身正部级干部。只是在这个位置上，他最终没有干满一年。" }, { id: "P27", name: "平兴", photo: "平兴.jpg", information: "成都高投董事长/" }, { id: "P28", name: "孙建成", photo: "", information: "前成都市青白江区区长；2013年12月底被带走调查。/孙建成2005年10月至2011年11月曾担任成都市青白江区委书记，周永康三弟之子周峰2010年拿下青白江区集装箱物流园区建材城项目，即发生在孙建成任期内。" }, { id: "P29", name: "张俊", photo: "", information: "成都建工集团董事长/张俊2002年38岁时即开始担任成都建工集团董事长、党委书记，他曾经指令集团下属成都建工地产开发公司从周永康三弟之子周锋手中买下成都正恒置业有限公司50%股份，并帮助成都正恒夺得双流县兴隆镇城市改造项目。" }, { id: "P32", name: "朱莉萍", photo: "", information: "张伟妻子/朱莉萍的爱人张伟不仅是中石油最年轻的局级干部，也是周涵的直接上司，周滨的校友师兄。朱莉萍从2002年发起设立四川天丰，占有60%的股份，2003年12月将57%股权转让给詹敏利，到2009年中旭阳光改制后进入公司董事会，无论是水电站业务还是能源生意，都悄然出现在周滨的生意圈子中。" }, { id: "P33", name: "周晓华", photo: "", information: "周元兴之子/" }, { id: "P34", name: "郭连星", photo: "", information: "出生于1971年，郭永祥之子，与詹敏利、米晓东有合伙生意。/2010年6月，郭连星担任法人代表的北京汇润阳光能源科技有限公司在北京朝阳区来广营乡奶白路3号设立，注册资金500万元，业务范围包括技术推广服务，经济贸易咨询，化工产品、机械设备、电子产品和矿产品销售。郭连星作为自然人股东在北京汇润阳光出资75万元，并担任法人代表、执行董事和经理，詹敏利和米晓东的汇盛阳光出资425万元，为大股东。2011年，汇润阳光等5家由詹敏利担任大股东的公司向朝阳区来广营乡租赁了约200平米的办公用房和周边300亩原本用于高尔夫球场的土地，租期20年，每亩年租金6000元，用途不明。在郭永祥被带走前不久的2013年6月8日，汇润阳光被注销。" }, { id: "P35", name: "余刚", photo: "余刚.png", information: "周永康最后一任秘书，中央政法委办公室原副主任。/余刚是秘书六人组中最为神秘的一位秘书，此前鲜有报道，更无公开简历。2013年7月2日，中央纪委首次披露余刚信息，已是其“双开”之时。2014年7月2日下午3时，中央纪委监察部网站发布消息，中央政法委办公室原副主任余刚因严重违纪违法问题被“双开”。经查，余刚利用职务上的便利为他人谋取利益，收受巨额贿赂；与他人通奸。余刚的上述行为已构成严重违纪，其中受贿问题已涉嫌违法犯罪。依据《中国共产党纪律处分条例》等有关规定，经中央纪委审议并报中共中央批准，决定给予余刚开除党籍、开除公职处分；将其涉嫌犯罪问题及线索移送司法机关依法处理。" }, { id: "P36", name: "谈红", photo: "谈红.png", information: "公安部警卫局原正师职参谋，曾担任周永康的警卫秘书。/2014年7月2日下午3时，中央纪委监察部网站发布消息，谈红因严重违纪违法被开除党籍。经查，谈红利用职务和地位形成的便利条件为他人谋取利益，索取、收受巨额贿赂。谈红的上述行为已构成严重违纪，其中受贿问题已涉嫌违法犯罪。依据《中国共产党纪律处分条例》的有关规定，经中央纪委审议并报中共中央批准，决定给予谈红开除党籍处分；将其涉嫌犯罪问题及线索移送司法机关依法处理。" }, { id: "P37", name: "李东生", photo: "李东生.png", information: "周永康在政法系统的亲信，曾任公安部副部长。/李东生青年时从军，进入中央警卫局，后以工农兵学员被保送复旦大学新闻系，毕业后到中央电视台工作。22年后官至央视副台长。在央视李东生有着截然相反的口碑。有人说他为一些具有尖锐批评性的央视调查报道提供了庇护，也有人说他“没能力，善钻营。”/2000年，李东生出任广电总局副局长，2002年5月升任中共中央宣传部副部长。“2007年的十七大，本来李东生很有希望进入中央委员会，成为正部级官员。”但是当时有人举报了李东生，涉及他的女儿到英国留学获得非法资助，弟弟李福生开广告公司，利用李的影响力获得利益输送，以及一桩更为严重的酒驾案。/“据说是周永康帮着李东生摆平了此事。”知情人说，他无法确定周永康和李东生在此前的交情如何，包括传说甚盛的李东生将曾在央视工作的贾晓晔介绍给周永康为续弦，“李东生当时主管央视新闻频道，贾晓晔只是央视二套财经频道的一个普通记者，两人应该少有交集”。/尽管有周永康的帮助，李东生还是没能成为中共十七届中央委员。2009年10月，从未有过政法工作经历的李东生出人意料地调任公安部党委成员、副部长，副总警监警衔。在周永康掌管的政法系统，李东生担任有一定独立性的中央防范和处理邪教问题领导小组副组长、办公室主任，国务院防范和处理邪教问题办公室主任，正式晋升正部级高干，并成为周永康手中的一枚利器。/2012年11月，李东生当选中共十八届中央委员。2013年12月20日，中央纪委宣布李东生被查。" }];
var CList = [{ id: "C0", name: "兴鼎电力", m: "A", information: "曾为汉龙集团子公司，刘汉为在四川阿坝州开发毛儿盖河流域开发一库三级3个水电站而成立的公司，曾由周滨出面持股以获得政府支持。兴鼎电力全部股权于2013年年初、以近17亿元的价格转让他人" }, { id: "C1", name: "汉龙集团", m: "A", information: "刘汉名下企业集团,涉足能源电力、化工产业、生物医药、基础设施建设、地产开发、矿业开发、旅游开发等" }, { id: "C2", name: "陕西秋海汲清", m: "B", information: "2007年1月米晓东在西安参股设立，实际为周滨和米晓东掌控。该公司拥有位于宁夏自治区盐池县的长海项目合作开发权，后被卖给民营石油企业家王乐天" }, { id: "C3", name: "北京海天永丰", m: "B", information: "周滨的岳母詹敏利名下公司，詹出资350万元，持股70%，拥有2005年商务部核准的成品油批发经营资格。2007年12月，海天永丰石油销售有限公司出资500万元全资发起设立德淦石油，但2008年5月就将德淦石油转让给了王乐天的吉林天卓。2009年2月，海天永丰在北京注销。" }, { id: "C4", name: "陕西德淦石油", m: "B", information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。" }, { id: "C5", name: "长海项目", m: "B", information: "长庆油田位于宁夏自治区盐池县的区块，面积50平方公里" }, { id: "C6", name: "长印项目", m: "B", information: "长庆油田石油高产合作开发项目，面积50平方公里" }, { id: "C7", name: "长庆油田", m: "A", information: "中国第一大油气田，隶属于中石油，勘探区域主要在陕甘宁盆地" }, { id: "C8", name: "中旭(香港)", m: "B", information: "" }, { id: "C9", name: "北京中旭盛世风华投资", m: "B", information: "吴兵中旭系公司之一，注册在北京，从事影视投资。四川天蕴持股60%" }, { id: "C10", name: "北京幽兰文化基金会", m: "B", information: "北京中旭盛世风华设立，以振兴京剧为宗旨的公益基金" }, { id: "C11", name: "四川天丰水利资源", m: "B", information: "詹敏利曾控股57%" }, { id: "C12", name: "四川中旭投资", m: "B", information: "吴兵的中旭系的主体公司，2001年成立，注册资金5000万元。2001年时吴兵占10%股份，后受让公司另一股东成都新红苑的股份，规模不详" }, { id: "C13", name: "大渡河龙头石水电开发", m: "B", information: "中旭投资、四川天蕴和四川天丰合资组建，分别占股58%、29%和13%，负责建设和管理大渡河龙头石水电站，投资53亿元、总装机70万千瓦" }, { id: "C14", name: "革什扎水电开发", m: "B", information: "中旭系的中旭实业开发的水电项目，投资32亿元、总装机45万千瓦。中旭实业持有水电站40%股权" }, { id: "C15", name: "成温邛高速公路", m: "B", information: "中旭投资在四川投资过的一条高速公路，中旭投资和成都成温邛公路开发有限责任公司分别占股51%和49%。后成都交投集团斥资2.8亿元收购了中旭投资的这部分股权。成温邛高速公路是国道318线成都境内的一段，全长65.63公里，总投资约10亿元。" }, { id: "C17", name: "成都花样年", m: "B", information: "香港花样年在成都的子公司，中旭是该公司的非控股股东，持有10%股份" }, { id: "C18", name: "成都锦上花项目", m: "B", information: "成都花样年旗下项目" }, { id: "C19", name: "成都艺墅花乡项目", m: "B", information: "成都花样年旗下项目" }, { id: "C20", name: "成都文殊芳园", m: "B", information: "吴兵早年独立开发的房地产项目" }, { id: "C21", name: "四川天蕴", m: "B", information: "吴兵持股20%（2005年退出），为大渡河龙头石水电站投资方之一。拥有成都城西地区上千亩地的开发使用权" }, { id: "C22", name: "中旭总部办公基地", m: "B", information: "位于成都西郊，中旭中旭实业投资有限公司的总部大楼" }, { id: "C23", name: "成都天蕴中心会所", m: "B", information: "总部办公基地区域中心的一处会所" }, { id: "C24", name: "成都新红苑", m: "B", information: "四川天蕴提供物业管理服务的项目之一" }, { id: "C25", name: "四川天蕴资产管理", m: "B", information: "四川天蕴实业投资有限公司分立出来的公司" }, { id: "C26", name: "四川天资置业", m: "B", information: "脱胎于四川天蕴，旗下拥有225亩的土地" }, { id: "C27", name: "成都丽晶港项目", m: "B", information: "中旭系四川天资置业与佳兆业合资的房地产项目" }, { id: "C28", name: "北京中旭阳光能源", m: "B", information: "周滨掌控公司之一，詹敏利曾持股80%，后转给周滨持股" }, { id: "C29", name: "中国石油加油站零售管理项目", m: "B", information: "吴兵曾获得该项目大单" }, { id: "C30", name: "北京旭能合力", m: "B", information: "中旭阳光能源旗下子公司，提供石油天然气领域信息化服务的IT公司，成立于2008年，注册资金1000万元" }, { id: "C31", name: "无锡骏峰", m: "B", information: "2004年周玲英与周欣合资成立，由销售化肥农药起步后又经营消防设施、设备及器材" }, { id: "C32", name: "北京宏元达", m: "B", information: "北京宏汉持有47.25%股份" }, { id: "C33", name: "北京瑞丰勘查", m: "B", information: "北京宏汉100%控股子公司" }, { id: "C34", name: "北京信远宏大", m: "B", information: "北京宏汉持有89%股份" }, { id: "C35", name: "北京宏汉", m: "B", information: "周玲英出资5000万元成立，100%控股，周玲英之子周锋为董事长，通过独资、控股和参股掌控的多家公司合称“宏汉系”，为周家三房主要投资主体之一" }, { id: "C36", name: "北京鸿丰", m: "B", information: "北京宏汉持有43%股份" }, { id: "C37", name: "成都高投", m: "A", information: "成都高新区管委会批准成立的国有独资有限责任公司" }, { id: "C38", name: "高新发展", m: "A", information: "成都高投控股的上市公司" }, { id: "C39", name: "四川邛崃鸿丰钾肥", m: "B", information: "2007年由北京鸿丰投资和中石油四川石油管理局旗下的四川华油共同出资设立，注册资本为3亿元，其中北京鸿丰持有90%股份，四川华油持有10%股份" }, { id: "C40", name: "四川华油", m: "A", information: "四川石油管理局旗下公司" }, { id: "C41", name: "中石油", m: "A", information: "中国石油天然气集团公司，2013年全球500强第5位" }, { id: "C42", name: "昆仑能源", m: "A", information: "中石油控股的国际性能源公司，总部位于香港" }, { id: "C43", name: "新疆新捷", m: "A", information: "昆仑能源控股子公司" }, { id: "C44", name: "江苏中油昆仑能源", m: "A", information: "新疆新捷子公司" }, { id: "C45", name: "无锡中油昆仑能源", m: "B", information: "周玲英江阴奔跃与江苏中油合资公司" }, { id: "C46", name: "江阴澄捷", m: "B", information: "“无锡中油”与江苏江阴港港口集团股份有限公司合资成立的公司" }, { id: "C47", name: "江阴奔跃", m: "B", information: "周玲英控股公司，经营汽车及配件，代理销售奥迪品牌汽车" }, { id: "C48", name: "美国海斯科", m: "B", information: "黄渝生在美国注册的公司" }, { id: "C49", name: "Newrun International", m: "B", information: "黄渝生在美国注册的公司" }, { id: "C50", name: "北京海斯科", m: "B", information: "詹敏利持有80%股份，2002年6月在北京成立，2004年吊销" }, { id: "C55", name: "四川阿坝州九鼎山旅游项目", m: "B", information: "位于茂县境内，先有黄婉掌控的公司获独家开发权，后转让给刘汉" }, { id: "C57", name: "昀滢旭荣", m: "B", information: "詹敏利和米晓东合资公司" }, { id: "C58", name: "秋海旭荣", m: "B", information: "昀滢旭荣与北京昌平的南口农场的合资公司，拿到北京重点保障房建设的重点项目" }, { id: "C59", name: "南口农场公租房", m: "B", information: "是北京重点保障房建设的重点项目，包括公租房2020套的建设，以及项目附近350亩区域的一级开发" }, { id: "C60", name: "北京汇盛阳光", m: "B", information: "詹敏利持股90%，米晓东持股10%" }, { id: "C61", name: "北京威仪物业", m: "B", information: "注册资金500万美元，香港永惠发展100%控股" }, { id: "C62", name: "北京浩盛益佳", m: "B", information: "詹敏利持股90%，米晓东持股10%" }, { id: "C63", name: "北京建兴光泽", m: "B", information: "詹敏利持股80%，米晓东持股20%" }, { id: "C64", name: "四川松林河流域开发", m: "B", information: "中旭投资、四川天丰、成都花样年联合注册成立的公司，松林河是大渡河的支流" }, { id: "C65", name: "香港永惠发展", m: "B", information: "" }, { id: "C66", name: "四川宏润", m: "B", information: "宏汉系北京瑞丰勘查控股子公司，经营石油、天然气化工产品研究及开发" }, { id: "C67", name: "德阳宏润", m: "B", information: "四川宏润全资子公司" }, { id: "C68", name: "四川德阳液化天然气项目", m: "B", information: "四川宏润旗下项目" }, { id: "C69", name: "四川中石化", m: "A", information: "中石化四川天然气有限责任公司" }, { id: "C70", name: "德阳宏瑞", m: "B", information: "宏汉系北京瑞丰勘查全资持有的德阳宏瑞天然气有限公司，曾在四川德阳兴建液化天然气（LNG）项目，不过生产装置搁置几年都未投产。" }, { id: "C71", name: "四川中京燃气", m: "B", information: "中石化四川天然气有限责任公司和德阳宏瑞出资组建的公司" }, { id: "C72", name: "成都宏聚投资", m: "B", information: "宏汉系北京信远宏大及其全资子公司四川蓉腾置业有限公司出资1000万元设立，拿到成都市青白江区集装箱物流园区的宏聚建材城项目，股权随后被转让给英祥集团" }, { id: "C73", name: "四川蓉腾置业", m: "B", information: "宏汉系北京信远宏大的全资子公司" }, { id: "C74", name: "英祥国际建材城", m: "B", information: "成都宏聚股权被转让给起家自贡的地产商四川英祥集团后，宏聚建材城变身英祥国际建材城" }, { id: "C75", name: "成都青白江区项目", m: "A", information: "宏汉系公司曾拿到成都青白江区集装箱物流园区的宏聚建材城项目" }, { id: "C76", name: "成都正恒置业", m: "B", information: "宏汉系北京信远宏大2010年8月发起设立，占股60%" }, { id: "C77", name: "成都建工集团", m: "A", information: "成都市国资委下属的全民所有制企业" }, { id: "C78", name: "双流正恒开元置业", m: "B", information: "成都正恒置业全资子公司" }, { id: "C79", name: "双流县兴隆镇用地改造", m: "B", information: "" }, { id: "C80", name: "四川超越", m: "B", information: "黄婉与他人合资公司，拿到九鼎山景区的开发权" }, { id: "C83", name: "北京来广营三百亩土地租用", m: "B", information: "汇盛阳光等5家由詹敏利担任大股东的公司在2011年向来广营乡租赁的原本用于高尔夫球场的土地，租期20年，用途不详" }, { id: "C84", name: "五粮液代理生意", m: "B", information: "周家二房周元兴父子的主要业务" }, { id: "C85", name: "油田钢管生意", m: "B", information: "周元兴家业务" }, { id: "C86", name: "奥迪4S店", m: "B", information: "由江阴奔跃开设" }, { id: "C87", name: "龙头石水电站", m: "B", information: "" }, { id: "C88", name: "成都双流县花样年别样城", m: "B", information: "成都花样年项目" }, { id: "C89", name: "成都花样年别郡", m: "B", information: "成都花样年项目" }, { id: "C90", name: "成都温江金马镇花样年项目", m: "B", information: "成都花样年项目" }, { id: "C91", name: "成都喜年广场", m: "B", information: "成都花样年项目" }, { id: "C92", name: "成都花好园", m: "B", information: "成都花样年项目" }, { id: "C93", name: "成都美年国际广场", m: "B", information: "成都花样年项目" }, { id: "C94", name: "成都新津县花样年君山", m: "B", information: "成都花样年项目" }, { id: "C95", name: "成都蒲江县花样年大溪谷", m: "B", information: "成都花样年项目" }, { id: "C97", name: "成都银行", m: "B", information: "原成都市商业银行，吴兵中旭系曾于2008年参股" }, { id: "C98", name: "北京汇润阳光", m: "B", information: "周滨之父大秘书郭永祥之子郭连星，与周滨岳母詹敏利、白手套米晓东等人的合资公司，2010年6月设立，注册资金500万元，郭连星为自然人股东，出资75万元，并担任法人代表、执行董事和经理，詹敏利和米晓东的汇盛阳光出资425万元，为大股东。" }, { id: "C100", name: "青海省油田水循环利用", m: "B", information: "北京鸿丰持股50%" }, { id: "C101", name: "北京宏泰中汇创投", m: "B", information: "北京鸿丰持股99%" }, { id: "C102", name: "内蒙赤峰瑞银矿业", m: "B", information: "北京宏汉100%控股子公司" }, { id: "C103", name: "北京广隆嘉润", m: "B", information: "詹敏利持股80%，2009年注销" }, { id: "C104", name: "北京中旭阳光科技", m: "B", information: "詹敏利持股80%，2006年注销" }];
var CCList = [{ c1: "C1", to: ">", c2: "C0", m: "B" }, { c1: "C2", to: ">", c2: "C5", m: "B" }, { c1: "C3", to: ">", c2: "C4", m: "A" }, { c1: "C4", to: ">", c2: "C6", m: "B" }, { c1: "C7", to: ">", c2: "C5", m: "B" }, { c1: "C7", to: ">", c2: "C6", m: "B" }, { c1: "C9", to: ">", c2: "C12", m: "B" }, { c1: "C9", to: ">", c2: "C10", m: "B" }, { c1: "C11", to: ">", c2: "C13", m: "B" }, { c1: "C12", to: ">", c2: "C13", m: "B" }, { c1: "C12", to: ">", c2: "C14", m: "A" }, { c1: "C12", to: ">", c2: "C15", m: "A" }, { c1: "C12", to: ">", c2: "C17", m: "A" }, { c1: "C12", to: ">", c2: "C21", m: "B" }, { c1: "C13", to: ">", c2: "C20", m: "B" }, { c1: "C17", to: ">", c2: "C18", m: "B" }, { c1: "C17", to: ">", c2: "C19", m: "B" }, { c1: "C21", to: ">", c2: "C13", m: "B" }, { c1: "C21", to: ">", c2: "C22", m: "B" }, { c1: "C21", to: ">", c2: "C24", m: "B" }, { c1: "C21", to: ">", c2: "C25", m: "B" }, { c1: "C21", to: ">", c2: "C20", m: "B" }, { c1: "C25", to: ">", c2: "C23", m: "B" }, { c1: "C26", to: ">", c2: "C27", m: "B" }, { c1: "C28", to: ">", c2: "C29", m: "A" }, { c1: "C28", to: ">", c2: "C30", m: "B" }, { c1: "C35", to: ">", c2: "C32", m: "B" }, { c1: "C35", to: ">", c2: "C33", m: "B" }, { c1: "C35", to: ">", c2: "C34", m: "B" }, { c1: "C35", to: ">", c2: "C36", m: "B" }, { c1: "C36", to: ">", c2: "C39", m: "A" }, { c1: "C37", to: ">", c2: "C38", m: "B" }, { c1: "C38", to: ">", c2: "C39", m: "B" }, { c1: "C40", to: ">", c2: "C39", m: "A" }, { c1: "C41", to: ">", c2: "C40", m: "B" }, { c1: "C41", to: ">", c2: "C42", m: "B" }, { c1: "C41", to: ">", c2: "C29", m: "B" }, { c1: "C41", to: ">", c2: "C7", m: "B" }, { c1: "C42", to: ">", c2: "C43", m: "B" }, { c1: "C43", to: ">", c2: "C44", m: "B" }, { c1: "C45", to: ">", c2: "C46", m: "B" }, { c1: "C47", to: ">", c2: "C45", m: "B" }, { c1: "C57", to: ">", c2: "C58", m: "B" }, { c1: "C58", to: ">", c2: "C59", m: "B" }, { c1: "C12", to: ">", c2: "C64", m: "A" }, { c1: "C17", to: ">", c2: "C64", m: "A" }, { c1: "C11", to: ">", c2: "C64", m: "A" }, { c1: "C65", to: ">", c2: "C61", m: "B" }, { c1: "C33", to: ">", c2: "C66", m: "B" }, { c1: "C66", to: ">", c2: "C67", m: "B" }, { c1: "C67", to: ">", c2: "C68", m: "B" }, { c1: "C69", to: ">", c2: "C68", m: "B" }, { c1: "C33", to: ">", c2: "C70", m: "B" }, { c1: "C69", to: ">", c2: "C71", m: "B" }, { c1: "C70", to: ">", c2: "C71", m: "B" }, { c1: "C34", to: ">", c2: "C72", m: "A" }, { c1: "C73", to: ">", c2: "C72", m: "A" }, { c1: "C72", to: ">", c2: "C74", m: "B" }, { c1: "C34", to: ">", c2: "C76", m: "B" }, { c1: "C77", to: ">", c2: "C76", m: "B" }, { c1: "C76", to: ">", c2: "C78", m: "B" }, { c1: "C78", to: ">", c2: "C79", m: "B" }, { c1: "C44", to: ">", c2: "C45", m: "B" }, { c1: "C34", to: ">", c2: "C73", m: "B" }, { c1: "C75", to: ">", c2: "C72", m: "B" }, { c1: "C80", to: ">", c2: "C55", m: "A" }, { c1: "C1", to: ">", c2: "C55", m: "B" }, { c1: "C60", to: ">", c2: "C83", m: "B" }, { c1: "C47", to: ">", c2: "C86", m: "B" }, { c1: "C13", to: ">", c2: "C87", m: "B" }, { c1: "C17", to: ">", c2: "C88", m: "B" }, { c1: "C17", to: ">", c2: "C89", m: "B" }, { c1: "C17", to: ">", c2: "C90", m: "B" }, { c1: "C17", to: ">", c2: "C91", m: "B" }, { c1: "C17", to: ">", c2: "C92", m: "B" }, { c1: "C17", to: ">", c2: "C93", m: "B" }, { c1: "C17", to: ">", c2: "C94", m: "B" }, { c1: "C17", to: ">", c2: "C95", m: "B" }, { c1: "C12", to: ">", c2: "C97", m: "B" }, { c1: "C60", to: ">", c2: "C57", m: "B" }, { c1: "C60", to: ">", c2: "C98", m: "B" }, { c1: "C36", to: ">", c2: "C100", m: "B" }, { c1: "C36", to: ">", c2: "C101", m: "B" }, { c1: "C35", to: ">", c2: "C102", m: "B" }, { c1: "C21", to: ">", c2: "C26", m: "B" }];
var CPList = [{ c: "C0", to: "=", p: "P1", m: "A" }, { c: "C1", to: "=", p: "P23", m: "B" }, { c: "C2", to: "=", p: "P12", m: "A" }, { c: "C3", to: "=", p: "P6", m: "B" }, { c: "C7", to: "=", p: "P17", m: "B" }, { c: "C7", to: "=", p: "P18", m: "B" }, { c: "C8", to: "=", p: "P13", m: "B" }, { c: "C9", to: "=", p: "P13", m: "B" }, { c: "C11", to: "=", p: "P13", m: "B" }, { c: "C28", to: "=", p: "P1", m: "B" }, { c: "C28", to: "=", p: "P4", m: "B" }, { c: "C28", to: "=", p: "P6", m: "B" }, { c: "C28", to: "=", p: "P5", m: "B" }, { c: "C31", to: "=", p: "P9", m: "B" }, { c: "C31", to: "=", p: "P10", m: "B" }, { c: "C31", to: "=", p: "P11", m: "B" }, { c: "C35", to: "=", p: "P10", m: "B" }, { c: "C35", to: "=", p: "P11", m: "B" }, { c: "C37", to: "=", p: "P27", m: "B" }, { c: "C41", to: "=", p: "P14", m: "B" }, { c: "C41", to: "=", p: "P19", m: "B" }, { c: "C42", to: "=", p: "P15", m: "B" }, { c: "C47", to: "=", p: "P10", m: "B" }, { c: "C48", to: "=", p: "P5", m: "B" }, { c: "C48", to: "=", p: "P6", m: "B" }, { c: "C49", to: "=", p: "P5", m: "B" }, { c: "C50", to: "=", p: "P6", m: "B" }, { c: "C80", to: "=", p: "P4", m: "B" }, { c: "C11", to: "=", p: "P6", m: "B" }, { c: "C57", to: "=", p: "P6", m: "A" }, { c: "C57", to: "=", p: "P12", m: "B" }, { c: "C60", to: "=", p: "P6", m: "B" }, { c: "C60", to: "=", p: "P12", m: "B" }, { c: "C61", to: "=", p: "P6", m: "B" }, { c: "C62", to: "=", p: "P6", m: "B" }, { c: "C62", to: "=", p: "P12", m: "B" }, { c: "C63", to: "=", p: "P6", m: "B" }, { c: "C63", to: "=", p: "P12", m: "B" }, { c: "C65", to: "=", p: "P12", m: "B" }, { c: "C75", to: "=", p: "P28", m: "B" }, { c: "C77", to: "=", p: "P29", m: "B" }, { c: "C11", to: "=", p: "P32", m: "B" }, { c: "C28", to: "=", p: "P32", m: "B" }, { c: "C84", to: "=", p: "P8", m: "B" }, { c: "C84", to: "=", p: "P33", m: "B" }, { c: "C85", to: "=", p: "P8", m: "B" }, { c: "C85", to: "=", p: "P33", m: "B" }, { c: "C98", to: "=", p: "P34", m: "B" }, { c: "C103", to: "=", p: "P6", m: "B" }, { c: "C104", to: "=", p: "P6", m: "B" }];
var PPList = [{ p1: "P0", to: "=", p2: "P1", m: "A" }, { p1: "P0", to: "=", p2: "P2", m: "A" }, { p1: "P0", to: "=", p2: "P3", m: "A" }, { p1: "P0", to: "=", p2: "P8", m: "A" }, { p1: "P0", to: "=", p2: "P9", m: "A" }, { p1: "P0", to: ">", p2: "P14", m: "B" }, { p1: "P0", to: ">", p2: "P15", m: "C" }, { p1: "P0", to: ">", p2: "P20", m: "C" }, { p1: "P0", to: ">", p2: "P22", m: "B" }, { p1: "P0", to: ">", p2: "P24", m: "C" }, { p1: "P0", to: ">", p2: "P25", m: "C" }, { p1: "P0", to: ">", p2: "P26", m: "B" }, { p1: "P1", to: "=", p2: "P4", m: "A" }, { p1: "P1", to: ">", p2: "P12", m: "B" }, { p1: "P1", to: ">", p2: "P13", m: "B" }, { p1: "P4", to: "=", p2: "P5", m: "A" }, { p1: "P4", to: "=", p2: "P6", m: "A" }, { p1: "P8", to: "=", p2: "P9", m: "A" }, { p1: "P9", to: "=", p2: "P10", m: "A" }, { p1: "P9", to: "=", p2: "P11", m: "A" }, { p1: "P14", to: ">", p2: "P15", m: "B" }, { p1: "P14", to: ">", p2: "P16", m: "B" }, { p1: "P14", to: ">", p2: "P17", m: "B" }, { p1: "P14", to: ">", p2: "P18", m: "B" }, { p1: "P14", to: ">", p2: "P19", m: "B" }, { p1: "P1", to: ">", p2: "P32", m: "B" }, { p1: "P2", to: "=", p2: "P7", m: "A" }, { p1: "P1", to: "=", p2: "P3", m: "A" }, { p1: "P8", to: "=", p2: "P33", m: "A" }, { p1: "P10", to: "=", p2: "P11", m: "A" }, { p1: "P5", to: "=", p2: "P6", m: "A" }, { p1: "P1", to: ">", p2: "P6", m: "B" }, { p1: "P25", to: ">", p2: "P34", m: "A" }, { p1: "P0", to: ">", p2: "P35", m: "C" }, { p1: "P0", to: ">", p2: "P36", m: "C" }, { p1: "P0", to: ">", p2: "P37", m: "B" }];
var PS = ["P23", "", "G周家 ", "P13", "P32", "P12", "P6", "P5", "P4", "P1", "P3", "P7", "P2", "", "G石油", "P16", "P17", "P18", "P19", "P14", "P15", "P20", "", "P0", "", "P35", "P36", "P37", "", "G四川", "P34", "P25", "P24", "P26", "P22", "P27", "P28", "P29", "", "G周家", "P11", "P10", "P9", "P8", "P33", ];
var CS = ["C1", "C0", "TOP_SPACE", "C80", "C58", "C57", "C60", "C98", "C62", "C63", "C103", "C104", "C65", "C61", "C8", "C9", "C17", "C12", "C11", "C13", "C21", "C25", "C26", "C48", "C49", "C50", "C3", "C28", "C4", "C2", "TOP_SPACE", "C7", "C41", "C42", "C43", "C44", "C40", "C37", "C38", "C69", "C75", "C77", "TOP_SPACE", "C45", "C47", "C78", "C76", "C72", "C73", "C34", "C36", "C35", "C33", "C66", "C67", "C70", "C31", "C84", "C85", "C55", "BOTTOM_SPACE", "BOTTOM_SPACE", "C59", "BOTTOM_SPACE", "C83", "C10", "C88", "C89", "C90", "C91", "C92", "C93", "C94", "C95", "C19", "C18", "C64", "C97", "C15", "C14", "C87", "C20", "C22", "C24", "C23", "C27", "C30", "C6", "C5", "BOTTOM_SPACE", "BOTTOM_SPACE", "C29", "BOTTOM_SPACE", "BOTTOM_SPACE", "BOTTOM_SPACE", "BOTTOM_SPACE", "BOTTOM_SPACE", "C39", "C68", "BOTTOM_SPACE", "BOTTOM_SPACE", "BOTTOM_SPACE", "C46", "C86", "C79", "BOTTOM_SPACE", "C74", "BOTTOM_SPACE", "C100", "C101", "C102", "C32", "BOTTOM_SPACE", "BOTTOM_SPACE", "C71", ];
var BGColor = "#1e1e1e";
var PPMColor = [{ "m": "A", "name": "直系亲属", "color": "#fc3c3c" }, { "m": "B", "name": "上下级", "color": "#a43dcc" }, { "m": "C", "name": "秘书", "color": "#f1882d" }];
var CPColor = "#666";
var WeakenColor = "#666";
var CCMColor = [{ "m": "A", "name": "获益或已转让", "color": "#a4bd3c" }, { "m": "B", "name": "持股或控制", "color": "#6856de" }];
var CMColor = [{ "m": "A", "name": "相关企业", "color": "#cbcacc" }, { "m": "B", "name": "周氏家族下属企业", "color": "#45a4cc" }, { "m": "C", "name": "", "color": "#45a4cc" }, { "m": "D", "name": "", "color": "#45a4cc" }];
var redBlack = "<div style='margin-left:60px;'><p style='color:white; font-size:24px; text-align:center; height:60px;'>《周永康的红与黑》</p><div style='width:20%; float:left'><p style='width:80%;color:white; height:50px; font-size:16px;'>青春岁月</p><a target='_blank'target='_blank'href='http://china.caixin.com/2014-10-22/100741777.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>厚桥少年</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741796.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>一生最美好的时光</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741808.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>初露头角</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741829.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>辽河的周家四口</a></div><div style='width:20%; float:left; '><p style='width:80%;color:white;  height:50px; font-size:16px;'>周永康的三基石：石油、四川、政法</p><a target='_blank'href='http://china.caixin.com/2014-10-22/100741838.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>石油起家</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741844.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>国土部金跳板</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741854.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>三年川督</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741858.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>三个官场棋子</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741882.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>四川后院新管家</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741905.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>十年政法</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741925.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>运动治警</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741929.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>权力信徒</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741938.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>司改停滞</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741961.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>唱和重庆模式</a></div><div style='width:20%; float:left; '><p style='width:80%;color:white;  height:50px; font-size:16px;'>周因父之名——周氏攫财录</p><a target='_blank'href='http://china.caixin.com/2014-10-22/100741966.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>最“神秘”的富商</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741970.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“谁能有周滨硬呢？”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741973.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“折腾”四川</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741975.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>筑坝四川水电</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741977.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>无须耐心的生意</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741979.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>贾氏姐妹</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741984.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>卖五粮液的二叔</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741986.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>三叔家的生意经</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741993.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>周峰财技</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741998.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>投资触角广布</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100741998.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>周峰财技</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742003.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>卖奥迪的三婶</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742006.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>祖庐前的攀龙术</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742008.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>强拆辟建“永康大道”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742010.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“故居”风水考究</a></div><div style='width:20%; float:left;'><p style='width:79%; color:white;  height:50px;  font-size:16px; '>“红顶”、“灰顶”和“黑顶”</p><a target='_blank'href='http://china.caixin.com/2014-10-22/100742012.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>蒋洁敏上位</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742015.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>中石油腐败症</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742017.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>官商勾结的地方样本</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742022.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>何燕和邓鸿</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742025.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>空手套得成都“新会展”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742027.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>五颜六色的网</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742029.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“大师”的敛金术</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742031.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“奇人”曹永正</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742033.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>何华章的“桌下交易”</a></div><div style='width:20%; float:left; '><p style='width:80%;color:white; height:50px;  font-size:16px; '>“四面埋伏打老虎”</p><a target='_blank'href='http://china.caixin.com/2014-10-22/100742036.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>先挑四川系</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742038.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“大清洗”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742040.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>再破石油帮</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742042.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>轰然倒塌的“防火墙”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742044.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>三震政法</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742046.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>天涯海角也落网</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742048.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>“你懂的”</a><br><a target='_blank'href='http://china.caixin.com/2014-10-22/100742050.html'style='font-size:12px; color:#CFCFCF; line-height:24px '>尾声</a></div></div><div style='margin-top:40px; width:1240px; float:left;'><div style='border-top-style:solid; border-top-width:1px;border-top-color:#555; height:20px'></div><span style='font-size:14px; margin-right:40px; color:white; float:left'>编辑：黄晨、黄志敏</span><span style='font-size:14px; margin-right:40px; color:white;  float:left'>设计：任远、丁辰</span><span style='font-size:14px; margin-right:40px; color:white;  float:left'>开发：任远</span><span style='font-size:14px; margin-right:40px; color:white;  float:left'>监制：高昱、黄志敏</span><a target='_blank'href='http://datanews.blog.caixin.com/'style='font-size:14px; color:white;padding-left:20px; float:left'>财新数据可视化实验室 | Caixin Data Visualization Lab</a><a target='_blank'href='http://www.caixin.com/'style='font-size:14px; color:#FFCC66; padding-left:10px;float:right'>财新网caixin.com</a></div>";
document.write("<div style='background-color:" + BGColor + ";width:100%;'><div id='mainDiv'><canvas id='mainCanvas'></canvas></div></div>");
document.write("<div style='background-color:" + BGColor + "; width:100%;'><div style='background-color:" + BGColor + "; margin-left:auto; margin-right:auto; position:relative; width:1240px; height:600px;'><div style='height:40px;'></div>" + redBlack + "</div></div>");
var WIDTH = 1240;
var HEIGHT = 900;
var time = 0;
var mouseX = 0;
var mouseY = 0;
var stagePressed = true;
var clickObject = null;
var startText = "【财新网 caixin.com】/";
$(document).ready(function() { $("#mainDiv").css({ "width": "100%" });
    $("#mainCanvas").attr("width", WIDTH);
    $("#mainCanvas").attr("height", HEIGHT);
    $("#mainCanvas").css({ "display": "block", "margin-left": "auto", "margin-right": "auto", "background-color": BGColor }); var canvas = document.getElementById("mainCanvas"); var main = canvas.getContext("2d");
    canvas.addEventListener("mousemove", mousemove, false);
    canvas.addEventListener("mousedown", mousedown, false);

    function mousemove(e) { mouseX = e.clientX + $(window).scrollLeft() - $(canvas).offset().left;
        mouseY = e.clientY + $(window).scrollTop() - $(canvas).offset().top }

    function mousedown(e) { if (caixin.checkMouse()) { caixin.click() } for (var i = 0; i < PArray.length; i++) { if (PArray[i].checkMouse()) { PArray[i].click();
                stagePressed = false; return } } for (var i = 0; i < CArray.length; i++) { if (CArray[i].checkMouse()) { CArray[i].click();
                stagePressed = false; return } }
        stagePressed = true;
        clickObject = null } var logo = new Image();
    logo.src = "http://file.caixin.com/datanews/zhou/img/logo.png"; var mask = new Image();
    mask.src = "http://file.caixin.com/datanews/zhou/img/photo/mask.png"; var hasPhoto = false; var photo = new Image();
    photo.src = "";
    photo.onload = function() { hasPhoto = true };
    photo.onerror = function() { hasPhoto = false }; var INFO = function() { this.x = 930;
        this.y = 30;
        this.name = "";
        this.text = "";
        this.offsetX = 90;
        this.offsetY = 0;
        this.minWidth = 190;
        this.maxWidth = this.minWidth + this.offsetX;
        this.top = 40;
        this.bottom = 230;
        this.startY = 0;
        this.h = 0 };
    INFO.prototype.display = function() { main.globalAlpha = 1;
        main.fillStyle = "#fff";
        main.font = "13px 'Microsoft YaHei', 微软雅黑"; if (hasPhoto) { this.h = multiLineText(this.text, this.x + this.offsetX, this.y + 60 + this.offsetY + this.startY, this.minWidth) } else { this.h = multiLineText(this.text, this.x, this.y + 60 + this.offsetY + this.startY, this.maxWidth) }
        main.fillStyle = BGColor;
        main.fillRect(this.x, 0, this.maxWidth + 30, this.y + this.top);
        main.fillRect(this.x, this.y + this.bottom, this.maxWidth + 30, 800); if (this.h > this.bottom - this.top) { this.startY = (this.bottom - this.top) * .5;
            main.strokeStyle = "#444";
            main.lineWidth = 1;
            main.beginPath();
            main.moveTo(this.x + this.offsetX, this.y + 30); if (hasPhoto) { main.lineTo(this.x + this.offsetX + this.minWidth, this.y + 30) } else { main.lineTo(this.x + this.offsetX + this.maxWidth, this.y + 30) }
            main.stroke();
            main.strokeStyle = "#88c7e2";
            main.lineWidth = 1;
            main.beginPath();
            main.moveTo(this.x + this.offsetX, this.y + 30); if (hasPhoto) { main.lineTo(this.x + this.offsetX + Math.min(this.minWidth * -this.offsetY / (this.h - (this.bottom - this.top) + this.startY), this.minWidth), this.y + 30) } else { main.lineTo(this.x + this.offsetX + Math.min(this.maxWidth * -this.offsetY / (this.h - (this.bottom - this.top) + this.startY), this.maxWidth), this.y + 30) }
            main.stroke();
            this.offsetY -= .8; if (this.offsetY + this.startY <= -this.h) { this.offsetY = 0;
                this.count = 0 } } else { this.startY = 0 }
        main.fillStyle = "#fff";
        main.font = "16px 'Microsoft YaHei', 微软雅黑";
        main.fillText(this.name, this.x + this.offsetX, this.y + 20); if (hasPhoto) { main.drawImage(photo, this.x, this.y, 80, 80);
            main.drawImage(mask, this.x, this.y, 80, 80);
            this.offsetX = 90 } else { this.offsetX = 0 } }; var caixin_logo = new Image();
    caixin_logo.src = "http://file.caixin.com/datanews/yuanren/logo_white_60.png"; var Caixin = function() { this.x;
        this.y };
    Caixin.prototype.display = function() { main.drawImage(caixin_logo, this.x, this.y, 45, 48) };
    Caixin.prototype.checkMouse = function() { return mouseX > this.x && mouseX < this.x + 100 && mouseY > this.y && mouseY < this.y + 100 };
    Caixin.prototype.click = function() { window.open("http://www.caixin.com") }; var caixin = new Caixin(); var LogoAndLegend = function() { this.logoX = 10;
        this.PPMLegendX = 20;
        this.CCMLegendX = 300;
        this.CMLegendX = 600;
        this.LegendY = 870;
        this.y = 20;
        caixin.x = 180;
        caixin.y = this.y + 10 };
    LogoAndLegend.prototype.display = function() { main.drawImage(logo, this.logoX, this.y + 5, 160, 75);
        PPMLegend(this.PPMLegendX, this.y + this.LegendY, 40);
        CCMLegend(this.CCMLegendX, this.y + this.LegendY, 40);
        CMLegend(this.CMLegendX, this.y + this.LegendY, 40);
        caixin.display() }; var G = function(name) { this.name = name;
        this.alpha = 1;
        this.weaken = false };
    G.prototype.display = function() { if (this.weaken) { this.alpha = .5 } else { this.alpha = 1 }
        main.fillStyle = "#c7b299";
        main.globalAlpha = this.alpha;
        main.font = "14px 'Microsoft YaHei', 微软雅黑";
        verticalText(this.name, this.x, this.y + 8, 16) }; var P = function(id, name, photo, information) { this.id = id;
        this.name = name;
        this.photo = photo;
        this.information = startText + information;
        this.init() };
    P.prototype.init = function() { this.over = false;
        this.font = "14px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 16;
        this.alpha = 1;
        this.color = "#fff";
        this.weaken = false };
    P.prototype.display = function() { if (this.weaken) { this.color = WeakenColor } else { this.color = "#fff" }
        main.globalAlpha = this.alpha;
        main.fillStyle = this.color;
        main.font = this.font;
        verticalText(this.name, this.x, this.y + 8, this.lineHeight); if (this.number) { this.subscript(this.number) } };
    P.prototype.subscript = function(number) { main.fillStyle = "#fff";
        main.beginPath();
        main.arc(this.x, this.y + 72, 7, 0, 2 * Math.PI);
        main.fill();
        main.font = "12px 'Microsoft YaHei', 微软雅黑";
        main.fillStyle = "#000";
        main.fillText(number, this.x - 3, this.y + 76) };
    P.prototype.checkMouse = function() { return mouseX > this.x - 12 && mouseX < this.x + 12 && mouseY > this.y && mouseY < this.y + 100 };
    P.prototype.checkMouseEvent = function() { if (this.checkMouse()) { if (!this.over) { this.over = true;
                this.mosueOver() }
            this.weaken = false } else { if (this.over) { this.over = false;
                this.mosueOut() } } };
    P.prototype.mosueOver = function() { this.font = "18px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 18; if (this.photo != "") { photo.src = "http://file.caixin.com/datanews/zhou/img/photo/" + this.photo } else { hasPhoto = false }
        info.name = this.name;
        info.text = this.information;
        info.y = 40;
        info.offsetY = 0 };
    P.prototype.mosueOut = function() { this.font = "14px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 16 };
    P.prototype.click = function() { clickObject = this };
    P.prototype.connectChildren = function() { for (var i = 0; i < PPArray.length; i++) { if (PPArray[i].p1.id == this.id) { PPArray[i].display();
                PPArray[i].p1.weaken = false;
                PPArray[i].p2.weaken = false } } };
    P.prototype.connectParent = function() { for (var i = 0; i < PPArray.length; i++) { if (PPArray[i].p2.id == this.id) { PPArray[i].display();
                PPArray[i].p1.weaken = false;
                PPArray[i].p1.connectParent() } } }; var C = function(id, name, m, information) { this.id = id;
        this.name = name;
        this.m = m;
        this.information = startText + information;
        this.init() };
    C.prototype.init = function() { this.over = false;
        this.font = "12px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 16;
        this.color = getColorByCM(this.m);
        this.alpha = 1;
        this.weaken = false };
    C.prototype.display = function() { if (this.weaken) { this.color = WeakenColor } else { this.color = getColorByCM(this.m) }
        main.globalAlpha = this.alpha;
        main.fillStyle = this.color;
        main.font = this.font;
        verticalText(this.name, this.x, this.y + 8, this.lineHeight) };
    C.prototype.checkMouse = function() { return mouseX > this.x - 10 && mouseX < this.x + 10 && mouseY > this.y && mouseY < this.y + 200 };
    C.prototype.checkMouseEvent = function() { if (this.checkMouse()) { if (!this.over) { this.over = true;
                this.mosueOver() }
            this.weaken = false;
            this.color = getColorByCM(this.m) } else { if (this.over) { this.over = false;
                this.mosueOut() } } };
    C.prototype.mosueOver = function() { this.font = "16px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 18;
        hasPhoto = false; if (this.information != "") { if (this.name.charAt(0) == "/") { info.name = this.name.slice(1) } else { info.name = this.name }
            info.text = this.information;
            console.log(document.documentElement.clientHeight); if (document.documentElement.clientHeight < 600) { info.y = 190 } else { info.y = 40 } } else { info.name = "";
            info.text = "" }
        info.offsetY = 0 };
    C.prototype.mosueOut = function() { this.font = "12px 'Microsoft YaHei', 微软雅黑";
        this.lineHeight = 16 };
    C.prototype.click = function() { clickObject = this };
    C.prototype.connectChildren = function() { this.weaken = false; for (var i = 0; i < CCArray.length; i++) { if (CCArray[i].c1.id == this.id) { CCArray[i].display(); var c2 = getCByID(CCList[i].c2);
                c2.connectChildren() } } };
    C.prototype.connectParent = function() { this.weaken = false; for (var i = 0; i < CCArray.length; i++) { if (CCArray[i].c2.id == this.id) { CCArray[i].display(); var c1 = getCByID(CCList[i].c1);
                c1.connectParent();
                c1.connectP() } } };
    C.prototype.connectP = function() { this.weaken = false; for (var i = 0; i < CPArray.length; i++) { if (CPArray[i].c.id == this.id) { CPArray[i].display();
                CPArray[i].p.weaken = false;
                CPArray[i].c.weaken = false;
                CPArray[i].p.connectParent() } } }; var PP = function(p1, to, p2, m) { this.p1 = p1;
        this.to = to;
        this.p2 = p2;
        this.m = m;
        this.init() };
    PP.prototype.init = function() { this.x = (this.p1.x + this.p2.x) * .5;
        this.y = this.p1.y;
        this.r = Math.abs(this.p1.x - this.p2.x) * .5;
        this.color = getColorByPPM(this.m);
        this.xpath = new Array();
        this.ypath = new Array();
        this.n = 200; for (var i = 0; i < this.n; i++) { if (this.p2.x - this.p1.x > 0) { this.xpath[i] = this.x + Math.cos(-i % this.n / this.n * Math.PI) * this.r;
                this.ypath[i] = this.y + Math.sin(-i % this.n / this.n * Math.PI) * this.r } else { this.xpath[i] = this.x + Math.cos(-Math.PI + i % this.n / this.n * Math.PI) * this.r;
                this.ypath[i] = this.y + Math.sin(-Math.PI + i % this.n / this.n * Math.PI) * this.r } } };
    PP.prototype.display = function() { main.globalAlpha = 1;
        main.strokeStyle = this.color;
        main.beginPath();
        main.arc(this.x, this.y, this.r, Math.PI, 0);
        main.stroke(); if (this.to == ">") { var t = time % this.n;
            main.fillStyle = "#fff";
            main.beginPath();
            main.arc(this.xpath[t], this.ypath[t], 2.5, Math.PI * 2, 0);
            main.fill() } }; var CC = function(c1, to, c2, m) { this.c1 = c1;
        this.to = to;
        this.c2 = c2;
        this.m = m;
        this.init() };
    CC.prototype.init = function() { this.x = (this.c1.x + this.c2.x) * .5;
        this.y = this.c1.y;
        this.r = Math.abs(this.c1.x - this.c2.x) * .5;
        this.color = getColorByCCM(this.m);
        this.xpath = new Array();
        this.ypath = new Array();
        this.n = 200; for (var i = 0; i < this.n; i++) { if (this.c2.x - this.c1.x > 0) { this.xpath[i] = this.x + Math.cos(-i % this.n / this.n * Math.PI) * this.r;
                this.ypath[i] = this.y + Math.sin(-i % this.n / this.n * Math.PI) * this.r } else { this.xpath[i] = this.x + Math.cos(-Math.PI + i % this.n / this.n * Math.PI) * this.r;
                this.ypath[i] = this.y + Math.sin(-Math.PI + i % this.n / this.n * Math.PI) * this.r } } };
    CC.prototype.display = function() { main.globalAlpha = 1;
        main.strokeStyle = this.color; if (this.c2.type == "arc") { main.beginPath();
            main.arc(this.x, this.y, this.r, Math.PI, 0);
            main.stroke(); if (this.to == ">") { var t = time % this.n;
                main.fillStyle = "#fff";
                main.beginPath();
                main.arc(this.xpath[t], this.ypath[t], 2.5, Math.PI * 2, 0);
                main.fill() } } else { main.globalAlpha = .5;
            main.strokeStyle = this.color;
            main.beginPath();
            main.moveTo(this.c1.x, this.c1.y + 180);
            main.lineTo(this.c2.x, this.c2.y);
            main.stroke(); if (this.c1.y + this.c1.name.length * 18 + 10 < this.c1.y + 180) { main.beginPath();
                main.moveTo(this.c1.x, this.c1.y + this.c1.name.length * 18 + 10);
                main.lineTo(this.c1.x, this.c1.y + 180);
                main.stroke() } } }; var CP = function(c, to, p, m) { this.c = c;
        this.to = to;
        this.p = p;
        this.m = m;
        this.color = getColorByCCM(this.m) };
    CP.prototype.display = function() { if (clickObject != null) { main.globalAlpha = .5;
            main.strokeStyle = this.color } else { main.globalAlpha = 1;
            main.strokeStyle = CPColor }
        main.beginPath();
        main.moveTo(this.p.x, this.p.y + 72);
        main.lineTo(this.c.x, this.c.y);
        main.stroke() }; var GArray = new Array(); var PArray = new Array(); var CArray = new Array(); var PPArray = new Array(); var CPArray = new Array(); var CCArray = new Array(); var logoAndLegend = new LogoAndLegend(); var info = new INFO(); for (var i = 0; i < PS.length; i++) { var space = 20; var x = 20; var y = 200; if (PS[i] != "") { if (PS[i].charAt(0) == "G") { var g = new G(PS[i].slice(1));
                g.x = x + i * space;
                g.y = y;
                GArray.push(g) } else { var pData = getPDataByID(PS[i]); var p = new P(pData.id, pData.name, pData.photo, pData.information);
                p.x = x + i * space;
                p.y = y;
                PArray.push(p) } } } var space = 20; var x1 = 0; var x2 = 0; var y = 400; for (var i = 0; i < CS.length; i++) { if (CS[i] != "TOP_SPACE" && CS[i] != "BOTTOM_SPACE") { var cData = getCDataByID(CS[i]); var c = new C(cData.id, cData.name, cData.m, cData.information); if (!CtoPs(CS[i]) && !CtoCs(CS[i])) { c.type = "line";
                x2 += space;
                c.x = x2;
                c.y = y + 250 } else { c.type = "arc";
                x1 += space;
                c.x = x1;
                c.y = y }
            CArray.push(c) } else { if (CS[i] == "TOP_SPACE") { x1 += space } else { x2 += space } } }

    function CtoPs(c) { for (var i = 0; i < CPList.length; i++) { if (CPList[i].c == c) { return true } } return false }

    function CtoCs(c) { for (var i = 0; i < CCList.length; i++) { if (CCList[i].c1 == c) { return true } } return false } for (var i = 0; i < PPList.length; i++) { var p1 = getPByID(PPList[i].p1); var p2 = getPByID(PPList[i].p2); var pp = new PP(p1, PPList[i].to, p2, PPList[i].m);
        PPArray.push(pp) } for (var i = 0; i < CPList.length; i++) { var c = getCByID(CPList[i].c); var p = getPByID(CPList[i].p); var cp = new CP(c, CPList[i].to, p, CPList[i].m);
        CPArray.push(cp) } for (var i = 0; i < CCList.length; i++) { var c1 = getCByID(CCList[i].c1); var c2 = getCByID(CCList[i].c2); var cc = new CC(c1, CCList[i].to, c2, CCList[i].m);
        CCArray.push(cc) }
    window.requestAnimFrame = (function() { return window.requestAnimationFrame || window.webkitRequestAnimationFrame || window.mozRequestAnimationFrame || window.oRequestAnimationFrame || window.msRequestAnimationFrame || function(callback) { window.setTimeout(callback, 1000 / 33) } })();
    (function draw() { requestAnimFrame(draw);
        main.clearRect(0, 0, canvas.width, canvas.height);
        main.lineWidth = 1;
        info.display();
        logoAndLegend.display(); for (var i = 0; i < GArray.length; i++) { if (clickObject == null) { GArray[i].weaken = false } else { GArray[i].weaken = true }
            GArray[i].display() } for (var i = 0; i < PArray.length; i++) { if (clickObject == null || clickObject == PArray[i]) { PArray[i].weaken = false } else { PArray[i].weaken = true }
            PArray[i].checkMouseEvent() } for (var i = 0; i < CArray.length; i++) { if (clickObject == null || clickObject == CArray[i]) { CArray[i].weaken = false } else { CArray[i].weaken = true }
            CArray[i].checkMouseEvent() } for (var i = 0; i < PPArray.length; i++) { if (clickObject == null || PPArray[i].p1.id == clickObject.id || PPArray[i].p2.id == clickObject.id) { PPArray[i].display();
                PPArray[i].p1.weaken = false;
                PPArray[i].p2.weaken = false; if (clickObject != null && PPArray[i].p1.id == clickObject.id) { PPArray[i].p1.connectParent() } if (clickObject != null && PPArray[i].p2.id == clickObject.id) { PPArray[i].p2.connectParent() } } } for (var i = 0; i < CPArray.length; i++) { if (clickObject == null || CPArray[i].p.id == clickObject.id || CPArray[i].c.id == clickObject.id) { CPArray[i].display();
                CPArray[i].p.weaken = false;
                CPArray[i].c.weaken = false; if (clickObject != null && CPArray[i].p.id == clickObject.id) { CPArray[i].c.connectChildren() } if (clickObject != null && CPArray[i].c.id == clickObject.id) { CPArray[i].p.connectParent();
                    CPArray[i].p.connectChildren() } } } for (var i = 0; i < CCArray.length; i++) { if (clickObject == null || CCArray[i].c1.id == clickObject.id || CCArray[i].c2.id == clickObject.id) { CCArray[i].c1.weaken = false;
                CCArray[i].display(); if (clickObject != null && CCArray[i].c1.id == clickObject.id) { var c1 = getCByID(CCList[i].c1);
                    c1.connectChildren() } if (clickObject != null && CCArray[i].c2.id == clickObject.id) { var c2 = getCByID(CCList[i].c2);
                    c2.connectParent();
                    c2.connectChildren() } } } for (var i = 0; i < PArray.length; i++) { PArray[i].display() } for (var i = 0; i < CArray.length; i++) { CArray[i].display() }
        time++ })();

    function getPDataByID(id) { for (var i = 0; i < PList.length; i++) { if (PList[i].id == id) { return PList[i] } } }

    function getPByID(id) { for (var i = 0; i < PArray.length; i++) { if (PArray[i].id == id) { return PArray[i] } } }

    function getCDataByID(id) { for (var i = 0; i < CList.length; i++) { if (CList[i].id == id) { return CList[i] } } }

    function getCByID(id) { for (var i = 0; i < CArray.length; i++) { if (CArray[i].id == id) { return CArray[i] } } }

    function verticalText(string, x, y, h) { var vertical = true;
        main.save();
        main.translate(x, y); for (var i = 0; i < string.length; i++) { if (string.charCodeAt(i) > 255) { main.translate(0, h);
                main.fillText(string.charAt(i), -main.measureText(string.charAt(i)).width / 2, 0) } else { main.save();
                main.translate(-5, 6);
                main.rotate(Math.PI / 2);
                main.fillText(string.charAt(i), 0, 0);
                main.restore();
                main.translate(0, main.measureText(string.charAt(i)).width + 2) } }
        main.restore() }

    function multiLineText(string, x, y, w) { var tx = 28; var ty = 0; for (var i = 0; i < string.length; i++) { var c = string.charAt(i); if (c != "/") { main.fillText(c, x + tx, y + ty);
                tx += main.measureText(c).width + 2; if (tx > w) { tx = 0;
                    ty += 20 } } else { tx = 28;
                ty += 40 } } return ty + 20 }

    function PPMLegend(x, y, space) { for (var i = 0; i < PPMColor.length; i++) { main.globalAlpha = 1;
            main.fillStyle = PPMColor[i].color;
            main.fillRect(x - 8, y - 1, 16, 2); if (PPMColor[i].m != "A") { main.fillStyle = "#fff";
                main.beginPath();
                main.arc(x, y, 2.5, 0, Math.PI * 2);
                main.fill() }
            main.fillStyle = "#ccc";
            main.font = "12px 'Microsoft YaHei', 微软雅黑";
            main.fillText(PPMColor[i].name, x + 14, y + 4);
            x += main.measureText(PPMColor[i].name).width + space } }

    function CCMLegend(x, y, space) { for (var i = 0; i < CCMColor.length; i++) { main.globalAlpha = 1;
            main.fillStyle = CCMColor[i].color;
            main.fillRect(x - 8, y - 1, 16, 2);
            main.fillStyle = "#fff";
            main.beginPath();
            main.arc(x, y, 2.5, 0, Math.PI * 2);
            main.fill();
            main.fillStyle = "#ccc";
            main.font = "12px 'Microsoft YaHei', 微软雅黑";
            main.fillText(CCMColor[i].name, x + 14, y + 4);
            x += main.measureText(CCMColor[i].name).width + space } }

    function CMLegend(x, y, space) { for (var i = 0; i < 2; i++) { main.globalAlpha = 1;
            main.fillStyle = CMColor[i].color;
            main.fillRect(x - 4, y - 4, 8, 8);
            main.fillStyle = "#ccc";
            main.font = "12px 'Microsoft YaHei', 微软雅黑";
            main.fillText(CMColor[i].name, x + 14, y + 4);
            x += main.measureText(CMColor[i].name).width + space } }

    function getColorByPPM(m) { for (var i = 0; i < PPMColor.length; i++) { if (PPMColor[i].m == m) { return PPMColor[i].color } } }

    function getColorByCCM(m) { for (var i = 0; i < CCMColor.length; i++) { if (CCMColor[i].m == m) { return CCMColor[i].color } } }

    function getColorByCM(m) { for (var i = 0; i < CMColor.length; i++) { if (CMColor[i].m == m) { return CMColor[i].color } } } });